[
    {
        "id": "0",
        "title": "Program Department Advising",
        "description": "Advising is a vital component in your graduate career and can significantly enhance your university experience. Each program department is designed with faculty members who serve as advisors. Graduate Program Coordinator are the primary guides for successful completion of your degree program. Graduate students should seek program department advising early in their graduate careers and regularly connect with Graduate Program Coordinators throughout their study."
    },
    {
        "id": "1",
        "title": "Clear Provisional Admissions",
        "description": "A graduate student may be provisionally admitted to the university. If you were admitted provisionally, you owe outstanding documents to the Graduate Admissions and Program Evaluations (GAPE) Office to complete your admission process. Visit your MySJSU To-Do list to identify the required documents to clear your provisional status. If you have any questions about the outstanding document, please contact the GAPE Evaluator for your program for further assistance. The GAPE Office determines the provisional admission; therefore, your graduate program department cannot remove this status. If a provision is not cleared by the date specified on the MySJSU To-Do list, you will not be able to register for the upcoming semester."
    },
    {
        "id": "2",
        "title": "Confirm Your Residency Status",
        "description": "Residency for tuition purposes determines whether a student pays in-state or out-of-state tuition fees and is a combination of physical presence, intent to remain in California indefinitely, and a valid immigration status. Information for First-Term StudentsFor information on residency rules, regulations, and appeals visit the Graduate Admissions California Residency webpage. California Residency classification as listed on your admission letter determines tuition. Should you have any questions, please contact the Graduate Admissions and Program Evaluations Office at graduate@sjsu.edu Information for Continuing StudentsFor more information on the Residency process, how to determine your eligibility or for instructions on how to apply, please visit the Residency webpage located on the Registrar Office website. Should you have any additional questions, please contact the Registrar  Office at registrar@sjsu.edu"
    },
    {
        "id": "3",
        "title": "Follow University Registration Processes",
        "description": "The Office of the Registrar is responsible for registration, grades, verification of enrollment and degree, official transcripts, reinstatement, and other student record functions. As a graduate student, it is crucial to know key registration steps, deadlines, and forms. Visit the Registrar's Office website to gain knowledge about the university's registration processes. Review the Academic Calendar to stay informed of any upcoming university dates. For additional assistance, review the following Registration Notes. Course Prerequisites: If a student has taken a prerequisite course outside of SJSU, they will need to submit an unofficial transcript to the course instructor. The instructor can issue a permission number to enroll in the course. Undergraduate Classes: Graduate students may take undergraduate classes. However, lower division (freshman and sophomore) courses numbered 1-99 cannot be used for graduate degree credit and are not included in the GPA computation. One Semester Leave: Graduate students may take one semester off without reapplying to the University. Summer is not considered a semester. For example, if you do not register in the Spring semester, you would need to register the following Fall semester to maintain your enrollment. *If students have completed coursework and are still working on their culminating experience, they are no longer permitted to take a semester leave; instead, culminating graduate students are required to maintain continuous enrollment each semester (Fall and Spring) until degree completion."
    },
    {
        "id": "4",
        "title": "Validate Eligible Graduate Transfer Credits",
        "description": "Per University policy, Graduate students are required to complete at least 70% of the units included in their proposed program in residence at SJSU. Therefore, a maximum of 9 units may be transferred into a 30-unit program from all sources. To review the complete policy, please visit the Transfer Credit section under Graduate Policies in the Academic Catalog. Transfer credit can be awarded by the Graduate Program Coordinator for post-baccalaureate courses taken at another university, as long as the courses were not counted for degree credit, or for graduate-level courses taken during the senior year as an SJSU undergraduate (final two undergraduate semesters) if the courses did not contribute to the bachelor degree. Students must request to have transfer credits validated. If an advanced evaluation is not necessary, transfer courses may simply be listed on your candidacy form [pdf] (Section C) and pending approval, will be processed upon submission of your department approved candidacy form. For students requesting an advanced evaluation of transfer credits, you must first submit the following to your designated Graduate Program Coordinator for approval: Once your request has been approved by your program department, the completed form must be routed online to the Graduate Admissions and Program Evaluations (GAPE) Office. The GAPE Office must have official transcripts in order to finalize the transfer process. Unless already on file, sealed official copies of transcripts be mailed to: Graduate Admissions and Program EvaluationsSan Jose State UniversityOne Washington SquareSan Jose, CA 95192-0017 Or requested to be sent electronically to: etranscript@sjsu.edu. Note: If an advanced evaluation is needed, an approved Request for Validation of Transfer Credit form must be submitted for each course you are requesting to have applied to your degree requirements."
    },
    {
        "id": "5",
        "title": "Achieve Graduate Classified Status",
        "description": "Your graduate department admitted you either to a conditionally classified or classified status. Students who were admitted conditionally classified have prerequisites that they must complete as outlined in their admission letter from SJSU. These prerequisites must be fulfilled prior to Advancement to Graduate Candidacy. If you have any questions on the prerequisites listed on your admissions letter, please contact your Graduate Program Coordinator. Once you have fulfilled all prerequisites outlined in your admission letter, make sure you notify your Graduate Program Coordinator and submit all required documentation to your graduate department. Your Graduate Program Coordinator will notify the Graduate Admissions and Program Evaluations (GAPE) Office that your status should be changed from conditional to classified status via one of two forms: 1. Change in Classification in Master's Program: Graduate Program Coordinators submit the change of classification form to GAPE, indicating that all student admission conditions have been fulfilled, allowing the student's conditional status to be lifted and establishing the classified status. 2. Petition for Advancement to Graduate Candidacy [pdf]: The Graduate Program Coordinator's signature on the candidacy form indicates that the Graduate Program Coordinator has checked that all conditions have been fulfilled, allowing the student's conditional status to be lifted and establishing the classified status. Graduate Program Coordinators do not need to submit the Change in Classification in Master  Program form to GAPE. Note: Do not list your pre-requisites on your candidacy form. Submission of a Graduate Program Coordinator approved candidacy form indicates that pre-program requirements have been fulfilled. The candidacy form should only include program requirements."
    },
    {
        "id": "6",
        "title": "Attend a GAPE Graduation Workshop",
        "description": "GAPE hosts Graduation Workshops each semester. These workshops consist of an information session on current graduate student university requirements, including filing for candidacy and applying for graduation. After the presentation, students are able to meet one-on-one with a GAPE Evaluator to ask questions regarding these processes."
    },
    {
        "id": "7",
        "title": "Follow the GAPE Steps to Graduation Brochure",
        "description": "The Steps to Graduation [pdf] brochure is a guide that will walk you through degree requirements and the graduation process. It compliments this online Graduate Student Guide and provides an overview of your entire graduate career."
    },
    {
        "id": "8",
        "title": "Achieve Graduate Classified Status",
        "description": "Your graduate department admitted you either to a conditionally classified or classified status. Students who were admitted conditionally classified have prerequisites that they must complete as outlined in their admission letter from SJSU. These prerequisites must be fulfilled per SJSU's Change in Classification policy prior to Advancement to Graduate Candidacy. If you have any questions on the prerequisites listed on your admissions letter, please contact your Graduate Program Coordinator. Once you have fulfilled all prerequisites outlined in your admission letter, make sure you notify your Graduate Program Coordinator and submit all required documentation to your graduate department. Your Graduate Program Coordinator will notify GAPE that your status should be changed from conditional to classified status via one of two forms: 1. Change in Classification in Master's Program: Graduate Program Coordinators submit the change of classification form to GAPE, indicating that all student admission conditions have been fulfilled, allowing the student's conditional status to be lifted and establishing the classified status. 2. Petition for Advancement to Graduate Candidacy [pdf]: The Graduate Program Coordinator's signature on the candidacy form indicates that the Graduate Program Coordinator has checked that all conditions have been fulfilled, allowing the student's conditional status to be lifted and establishing the classified status. Graduate Program Coordinators do not need to submit the Change in Classification in Master  Program form to GAPE. Note: Do not list your pre-requisites on your candidacy form. Submission of a Graduate Program Coordinator approved candidacy form indicates that pre-program requirements have been fulfilled. The candidacy form should only include program requirements."
    },
    {
        "id": "9",
        "title": "Complete a Minimum of 9 units of Letter-Graded Program Courses",
        "description": "All students must have completed a minimum of 9 letter-graded units (100 or 200 level courses), all with grades of C or higher, for their program. These 9 letter graded units must be listed on the candidacy form [pdf]."
    },
    {
        "id": "10",
        "title": "Fulfill the Graduation Writing Assessment Requirement (GWAR)",
        "description": "University Policy requires that all graduate students demonstrate competency in written English. Graduate students must satisfy the Graduation Writing Assessment Requirement (GWAR) before advancement to candidacy. Students Admitted Fall 2020 Semester or Later: Graduate students admitted in the Fall 2020 semester or later may satisfy the Graduation Writing Assessment Requirement (GWAR) in one of three ways: 1. Satisfactory completion of a GWAR course. Each graduate program has a designated GWAR course embedded within the program degree requirements. 2. Approval by the College of Graduate Studies of a professional publication written in English for which the candidate was a primary author.3. Completion of a master  or doctoral program with a substantive writing requirement at an accredited university in which the primary language of instruction is English. Each department may establish its own criteria within these policy guidelines. Waiving the program GWAR requirement will require the addition of an elective selected in consultation with the Graduate Program Coordinator. Student Admitted Prior to Fall 2020 Semester: Graduate students enrolled in their program prior to the Fall 2020 semester may meet their GWAR requirement in one of four ways: 1. Satisfactory completion of a baccalaureate degree at a CSU campus.2. Satisfactory completion of a GWAR course. Each graduate program has a designated GWAR course embedded within the program's degree requirements. 3. Approval by the Associate Dean of Graduate Studies of a well-written, professional (peer-reviewed) publication, graduate thesis or dissertation in which the student was the sole author.4. Satisfactory completion of a discipline-specific upper-division writing course at another university judged by the Associate Dean of Graduate Studies to be equivalent in content and writing requirements to the SJSU 100W."
    },
    {
        "id": "11",
        "title": "Complete all Program Courses with a C or Higher",
        "description": "All graduate students must complete all courses in the graduate degree program (as listed on the candidacy form) with grades between A and C, or CR. Grades of C or lower, including NC, IC and WU, are considered to be unsatisfactory and will prevent approval of your candidacy form. Prior to candidacy approval: Should a core course in the graduate degree program receive an unsatisfactory grade, this unsatisfactory grade must remain on the candidacy form and will be computed into the candidacy grade point average, along with the core course satisfactory grade. After candidacy approval: Should a course on the approved candidacy form receive an unsatisfactory grade, this unsatisfactory grade must remain on the candidacy form and will be computed into the candidacy grade point average. The course must then be repeated or replaced, depending on whether it is a core or elective course, per SJSU's Repeat Policy."
    },
    {
        "id": "12",
        "title": "Maintain a Minimum 3.0 GPA in Degree Program and Graduate Record",
        "description": "All graduate students must have a cumulative grade point average of a 3.0 in their graduate program (all courses listed on the candidacy form) and a cumulative grade point average of 3.0 on their SJSU graduate record (transcript) in order to Advance to Candidacy. Note: Lower division courses should not be listed on the candidacy form and are not included in this calculation."
    },
    {
        "id": "13",
        "title": "Complete Courses Within Time Limit",
        "description": "Graduate students must complete their degree program requirements within their appropriate time limit. Doctoral Students: Courses may be no older than 5 years Master Students: Courses may be no older than 7 years To review the full Time Limit policy pertaining to your graduate degree, please visit the respective section of the Academic Catalog: Doctoral | Master  If a course becomes outdated, students have the following options:"
    },
    {
        "id": "14",
        "title": "Meet All Graduate Program Requirements",
        "description": "Program Courses: Academic-Level 2022 At least half of the units included on the candidacy form (master's degree) must be in 200-level courses. Program Courses: Assigned Grading  2022 At least 60% of all units included on the candidacy form must be in letter-graded course work (i.e. A+, A, A-, B+, B, etc.). Therefore, 40% or a maximum of 12 units of a 30-unit program can be Credit/No Credit (CR/NC) courses. Transfer Credit Limit 2022 At least 70% of the units included must be in residence at SJSU. Therefore, 30% or a maximum of 9 units may be transferred into a 30-unit program from all sources (i.e. External Institutions, SJSU Open University, and/or SJSU Undergraduate Career). Catalog Degree Template 2022 Complete all requirements for the degree as listed in the degree template in the university catalog. Substitutions for core and other required courses in the template must be justified and approved by the Graduate Program Coordinator and department chair by submitting a Request for Course Substitution Petition (Core)."
    },
    {
        "id": "15",
        "title": "Follow Form Instructions",
        "description": "The candidacy form serves as a contract between the following parties: Graduate Admissions and Program Evaluations Office (GAPE)Graduate DepartmentGraduate Student Approval of the candidacy form indicates that by successfully completing coursework as listed on your form, you will be awarded a graduate degree. Once you have met the Criteria for Candidacy Advancement, you will want to complete each section of your candidacy form as accurately as possible. Student InformationThe information in this section should reflect what is currently listed in your MySJSU account. Should you need to update any of your personal information, please visit the Registrar Office Update Personal Information webpage for instructions. Degree InformationThe information in this section pertains to the degree you are currently seeking and the program you are working on completing. Here you will also indicate your means of satisfying the Graduation Writing Assessment Requirement (GWAR) and which Culminating Experience (Plan A, B, or C) you plan to complete. Proposed Graduate Degree ProgramFor these sections, you will use the following two resources in consultation with your Graduate Program Coordinator in order to complete your form: Section A 2013 CoursesTo begin, list each course in correspondence with your degree program requirements in the chronological semester order for which you plan to complete them. Then, while referencing your unofficial transcript, list the grade you have earned thus far for the associated course. Refrain from including grades for courses which have not been listed in your unofficial transcript. In-progress coursework grades should not be listed. Section B Culminating ExperienceIndicate which culminating experience you plan to complete in reference with your degree program requirements by utilizing the appropriate checkbox on the form. Your selection should mirror what you had previously listed in the Degree Information section of your form. Here you will also indicate the culminating experience course you plan to complete and the anticipated semester you plan to complete it in. Section C 2013 Transfer Courses/Total Program UnitsFor students who have not previously received an advanced evaluation of their transfer credits, you may indicate that coursework in this section of the form (if applicable). Please review the Validate Any Eligible Graduate Transfer Credits section of the Academic Planning webpage for information on how many units may be transferred in and which types of units qualify to be transferred in. Do not complete the Sub. for SJSU course portion, as it should be completed by your Graduate Program Coordinator, if applicable. This section of the form is also used to summarize the total number of units you will be required to complete in order to earn your degree. Under the portion titled Unit to the right-hand side of the document, enter the total number of units associated with sections A, B, and C of the form.Note: If you do not require review of any transfer coursework, only enter your total program units and then skip to the next section of the form. Required SignaturesComplete one final review of the information you have provided. It is vital that you sign your candidacy form as it certifies the accuracy of the information provided. You will then submit your form to your Graduate Program Coordinator and additionally, if required, your Project/Thesis Advisor for approval. Finally, once the required signatures are acquired, your form will need to be submitted to GAPE for review. Your form may be submitted to the GAPE Office via one of the following methods for review: Interoffice mail (extended ZIP 0017)Emailed directly to the assigned GAPE Program Evaluator"
    },
    {
        "id": "16",
        "title": "Meet Submission Deadlines",
        "description": "The deadline to submit your candidacy form for Graduate Admissions and Program Evaluations (GAPE) review, will depend on your expected graduation term. Please review the GAPE Deadlines webpage, which outlines the candidacy submission deadline (among other important deadlines), associated with your graduation term."
    },
    {
        "id": "17",
        "title": "Confirm Your Candidacy Status",
        "description": "You can confirm your Candidacy Status within your MySJSU portal. Additionally, a copy of your approved Candidacy form will be emailed to you. Your university-approved Candidacy form is your official document of degree progress. The GAPE Office will notify students of received and processed graduate forms by means of MySJSU Indicator. Indicators are located on the right navigation panel of the MySJSU Student Center. The MySJSU portal provides students with two tracking features: MyProgress and MyDegree Tracker. It is important to note that not all graduate programs are fully configured in these tracking features and features may not accurately reflect a graduate student's approved candidacy form."
    },
    {
        "id": "18",
        "title": "Academic Standing",
        "description": "Graduate students must maintain certain academic requirements in order to remain in good standing.\" Maintain a minimum grade point average of 3.0 (B) while completing requirements in your degree program. Failure to maintain the required minimum GPA may result in Academic Probation or subsequently, Academic Disqualification. Should a student be academically disqualified, please consult with your Graduate Program Coordinator regarding the Reinstatement Process. Complete all courses in the graduate degree program with grades between A and C, or CR. Grades of C-or lower, including NC, UIC and WU, are considered to be unsatisfactory. Should courses in the graduate degree program be completed with unsatisfactory grades, these grades must remain in the program and will continue to be computed in the grade point average of the program whether they are repeated or not. Students who earn an unsatisfactory grade must work with their Graduate Program Coordinator to add another course to their proposed program with equivalent unit value to the course in which they received the unsatisfactory grade. For more information, please review the complete Academic Standing policy in the Academic Catalog."
    },
    {
        "id": "19",
        "title": "Change of Program",
        "description": "Students who are currently enrolled and wish to change their graduate program may do so by submitting a Change of Graduate Program Petition. Students should follow the priority deadlines listed below when making their request: Priority Filing DeadlinesStart Term of Fall Semester - File petition by July 1stStart Term of Spring Semester - File petition by December 1st Prior to submitting the petition, it is recommended that students contact the Graduate Program Coordinator for the new degree program regarding any additional documents which may be needed for consideration into their major. After submission, the petition will be evaluated by the Graduate Admissions and Program Evaluations (GAPE) Office for eligibility. Eligible students will have their academic information sent to the Graduate Program Coordinator for the new major. Submission of this petition alone does not indicate approval. Final approval is decided by the department Graduate Program Coordinator, who will subsequently inform GAPE of their decision. If the new department admits you into their program, your graduate program will be changed for the next available term. This process may take several weeks to complete. Once GAPE has been notified of the department decision, students will receive notification via their Other Indicators in their MySJSU account."
    },
    {
        "id": "20",
        "title": "Course Grades",
        "description": "Program Course Grades (Satisfactory): Graduate students must complete all courses in the graduate degree program with grades between A and C, or CR. Visit the University Catalog to review Graduation Requirements. Program Course Grades (Unsatisfactory): Grades of C- or lower, including NC, IC and WU, are considered to be unsatisfactory. Unsatisfactory grades must remain in the degree program and will continue to be computed in the GPA of the program. The candidacy form will record each program course repeated and the grade earned. Visit the Course Repetition section below or the Repeat Policy in the catalog for more information. Transcript Course Grades (Grading System): Traditional letter grades are used for all courses taken by graduate students. Field work, thesis, project, individual study and internship courses are usually graded with non-traditional grades (Credit/No Credit). Graduate students do not have the option of choosing between the traditional or non-traditional grading system. Visit the Grading System in Graduate Work in the catalog. Note: The graduate program must include at least 60% of traditional letter-graded courses. Transcript Course Level (Grading System): Lower division undergraduate courses (01-99) cannot be used for graduate degree credit and are not included in the GPA computation. Note: A master's program must include at least 50% of 200-level courses."
    },
    {
        "id": "21",
        "title": "Course Repetition",
        "description": "University Policy F08-2 [pdf] stipulates that graduate students may repeat a maximum of 9 units in their graduate careers, regardless of the number of units required in a degree program. Transcript (Graduate Record): Graduate students and 200-level courses are not eligible for grade forgiveness. A graduate student transcript will indicate all SJSU courses repeated and the grades earned. Candidacy Form (Graduate Program): A student's candidacy form will record each program course repeated and the grade earned. Course grades will be effectively averaged in the program's GPA calculation. Grades of an NC, WU or IC, or letter grades below C (unsatisfactory grades) are recorded and must be repeated or compensated for in another way. This repeat policy is also true of courses in programs that have special grade requirements beyond those of the university standard, e.g., requirement of B grades in all core classes. Visit the University Repeat Policy in the catalog for more details. In addition, see Repetition of Courses for more information about registering for a class you are repeating."
    },
    {
        "id": "22",
        "title": "Course Revalidation",
        "description": "Section 40510(b)(2), California Code of Regulations, Title 5, Education, requires that courses completed within a graduate program must adhere to a time limit. If a course goes beyond the prescribed time period, it becomes expired or invalid. Doctoral Program Time Limit: 5 yearsMaster Program Time Limit: 7 years Graduate students have two options when a course becomes expired in their graduate program. Option 1: Repeat the outdated course with a passing grade. A graduate student may repeat a maximum of 9 units. Additional units gained by repeating a given course will not contribute to the degree total. Repeated grade will be factored into the GPA for graduation. Option 2: Revalidate the outdated SJSU course by examination. Graduate Program Coordinator will utilize the Request for Revalidation of Course form to resolve expired courses. A master's student may revalidate a maximum of 9 units of a 30-unit master degree program, or 12 units for a program with more than 30 units. To review the full Time Limit policy pertaining to your graduate degree, please visit the respective section of the Academic Catalog: Doctoral | Master"
    },
    {
        "id": "23",
        "title": "Course Substitution",
        "description": "The candidacy form, once approved, is an official contract between the student and university. Elective course substitutions and core course substitutions can be requested by submitting the Request for Course Substitution For the Graduate Degree. A course may not be dropped from the graduate degree program, as indicated by its appearance on a candidacy form, once the course has been completed."
    },
    {
        "id": "24",
        "title": "Disqualification and Reinstatement",
        "description": "Students are strongly advised to review University Disqualification Policy for more information. Academic disqualification occurs when a graduate student, on probation or continued probation, earns below a 3.0 GPA in a Fall or Spring term. Disqualified students must be successfully reinstated and readmitted in order to resume their graduate study. Reinstatement is a process separate from readmission."
    },
    {
        "id": "25",
        "title": "Leave of Absence",
        "description": "By University Policy S15-3 [pdf], a formal leave of absence for graduate students for medical, care-giving, military service, personal hardship, or educational reasons may be requested by submission of the fully signed and documented Leave of Absence Petition. For detailed information on the process and restrictions see Leaves of Absence and Withdrawal. Graduate students are eligible for all leaves of absence except when finished with all degree requirements other than their culminating experience (thesis, project, and/or comprehensive exam plus any other components required of the program). At that point, neither voluntary absence for a semester nor financial leaves are permissible."
    },
    {
        "id": "26",
        "title": "Second Master's Degree",
        "description": "There are two options for acquiring a second master degree: sequential or simultaneous. View the catalog for more details: Second Master's Degree."
    },
    {
        "id": "27",
        "title": "Plan A - Thesis (Master's Degree)",
        "description": "This plan requires selection and approval (by the Graduate Program Coordinator and/or the candidate's committee) of a thesis topic and its successful completion and production in bound form. The thesis plan is overseen by the College of Graduate Studies. Course enrollment: department 299 Thesis Details: forms, guidelines, and deadlines Catalog: Thesis Requirements"
    },
    {
        "id": "28",
        "title": "Plan B - Project or Comprehensive Exam (Master's Degree)",
        "description": "This plan requires students to undergo a combination of a comprehensive examination, final paper, or project. Students should consult with their Graduate Program Coordinator regarding this plan. Course enrollment: department 298 (project) or course set by department Catalog: Project/Comprehensive Exam Requirements Note: Students who fulfill their culminating experience requirement through Plan B cannot list 299 with a passing grade on their SJSU transcript. If a student has enrolled in 299, they must withdraw from the course or take a grade of NC."
    },
    {
        "id": "29",
        "title": "Plan C - Creative Work (Master's Degree)",
        "description": "This plan is reserved for cases in which the final requirement is met through a special creative assignment. The student is required to submit a written report on the creative project. The report is to be cataloged. This plan follows a similar pattern to the thesis option and is overseen by the College of Graduate Studies. Course enrollment: department 299 Creative Work Details: forms, guidelines, and deadlines Catalog: Creative Work Requirements"
    },
    {
        "id": "30",
        "title": "Project (Doctoral Degree)",
        "description": "It is California State University policy to require a doctoral project in the following programs: Doctor of Nursing Practice (DNP) programs - the DNP doctoral project shall be the written product of a systematic, rigorous, evidence-based endeavor focused on a significant nursing practice issue. Doctor of Audiology (AuD) programs - proposals may be undertaken as projects that are developed under the guidance of faculty and approved by the doctoral project committee. Course enrollment: department project course The project option is overseen by the College of Graduate Studies. Doctoral Project Details: forms, guidelines, and deadlines Catalog: Doctoral Project Requirements"
    },
    {
        "id": "31",
        "title": "Dissertation (Doctoral Degree)",
        "description": "It is California State University policy to require a dissertation in the following programs: Doctor of Education Degree (EdD) programs - the dissertation shall be the written product of systematic, rigorous research on a significant professional issue. Course enrollment: department 599 The dissertation option is overseen by the College of Graduate Studies. Dissertation Details: forms, guidelines, and deadlines Catalog: Dissertation Requirements"
    },
    {
        "id": "32",
        "title": "Thesis and Dissertation",
        "description": "The submission deadlines and processes for students who are completing a Thesis or Doctoral Dissertation (Plan A) for their Culminating Experience are determined and managed by the Office of the College of Graduate Studies. For a comprehensive list of these dates, please visit the Graduate Admissions and Program Evaluations Deadlines webpage for your anticipated graduation term or visit the College of Graduate Studies Thesis and Dissertation Submission and Publication Deadlines webpage. For any additional Thesis and Dissertation questions, please contact the College of Graduate Studies at graduate-studies@sjsu.edu."
    },
    {
        "id": "33",
        "title": "Project and Comprehensive Exams",
        "description": "Students who are completing a Department Project or Comprehensive Examination (Plan B) are to successfully complete their experience by the listed degree conferral date at the end of the semester for which they intend to graduate. To confirm that deadline or for other important semester dates, please visit the Deadlines page associated with your anticipated graduation term. This date can be found within the Important Dates and Timelines table."
    },
    {
        "id": "34",
        "title": "Creative Work",
        "description": "Students who are completing a Creative Project (Plan C) are required to submit a written report to the Office of the College of Graduate Studies on their creative project. To confirm that deadline or for more information, please visit the College of Graduate Studies website or contact their office at graduate-studies@sjsu.edu."
    },
    {
        "id": "35",
        "title": "Verification of Culminating Experience Form",
        "description": "The Graduate Admissions and Program Evaluations (GAPE) Office is notified of the completion of a student degree program requirements in two ways: The purpose of the Verification of Culminating Experience Form is to notify the GAPE Office that you have successfully satisfied all of your degree program requirements as per your designated department or school. It is the role of your Graduate Program Coordinator to submit the Verification of Culminating Experience Form on your behalf at the end of the semester for which you intend to graduate. However, it is the responsibility of the student to confirm the use of the form in conjunction with their program and ensure the form has been submitted to the GAPE Office. For students who are only required to conclude their degree program requirements via a final culminating experience course, it is your responsibility to successfully complete that predetermined course. Note: The Verification of Culminating Experience Form is not accessible to students and will not be accepted if submitted by a student. Each designated Graduate Program Coordinator has been granted access to the form and must submit it to the GAPE Office on behalf of the student."
    },
    {
        "id": "36",
        "title": "Enrollment Policy",
        "description": "Continuous enrollment is required of all graduate students between completion of regular courses and satisfactory completion of the culminating experience. Enrollment must be maintained in each Fall and Spring semester until degree completion. Graduate students may maintain enrollment by registering for a 1-unit 1290R course or by registering for other courses. Please note that departments may require repeated enrollment in a project, thesis, or comprehensive exam-preparation class. Consult with your Graduate Program Coordinator for additional instruction to successfully maintain continuous enrollment. For detailed information, visit the university catalog for the Continuous Enrollment Policy."
    },
    {
        "id": "37",
        "title": "1290R Registration",
        "description": "Eligible graduate students will be notified by the Registrar Office after the Add Deadline for the given semester. Students will be assigned a Special Session appointment for the 1290R course and they may then register online through their MySJSU portal. No permission or add code is necessary to register for the 1290R course. As the course is supervisory in nature, there are no formal meetings for 1290R. The enrollment allows students to maintain an active status (utilizing campus resources) while completing their culminating experience. Students are encouraged to register as soon as the MySJSU appointment is available; however, registration for 1290R must occur prior to the last day of course instruction for the given term. Note for International Students: To maintain their immigration status, international students are encouraged to add the course as soon as their appointments are available and within 30 days."
    },
    {
        "id": "38",
        "title": "Retroactive 1290R Registration",
        "description": "Continuous enrollment is a university graduation requirement. Therefore, failure to register for this unit will result in a hold on graduation until the 1290R unit is retroactively added in each Fall and Spring term lacking required enrollment. At that time, late fees will apply. To retroactively add a 1290R course, the student is required to complete an online Retroactive Requests for 1290R form, and payment of associated tuition and fees."
    },
    {
        "id": "39",
        "title": "Online Graduation Application",
        "description": "The application for graduation consists of an online form. Two weeks after your candidacy form is approved by the GAPE office, you will receive a MySJSU message prompting you to apply for graduation through your MySJSU account. The message will let you know that you are eligible to apply for graduation and will contain instructions on applying. Only students that apply for graduation will be considered for graduation review. If you would like to access instructions on applying for graduation prior to receiving the MySJSU message, GAPE has an Online Graduation Application Instructions [pdf] and a video tutorial."
    },
    {
        "id": "40",
        "title": "Graduation Application Eligibility",
        "description": "Students become eligible to apply for graduation two weeks after their candidacy form has been approved by the GAPE office. In addition, in order to become eligible to apply for graduation, students must be in active (enrolled) status, hold a cumulative GPA 3.0 or above, and have earned a minimum of 15 academic units. Students are ineligible to apply for graduation if they have submitted a prior application for graduation or are currently enrolled at SJSU as a credential, certificate or Open University student."
    },
    {
        "id": "41",
        "title": "Facilitation of Graduation",
        "description": "Pursuant to Title 5, Section 40411, and Presidential Directive (PD) 2009-05 [pdf], graduate students are precluded from enrolling in any additional state-supported courses when that student has already met all necessary requirements for the degree. Students who have met all requirements for graduation prior to any semester in which they are enrolled will be permitted to drop all courses for which they are registered, with little or no penalty. Students who have earned more than enough units to graduate but have some remaining requirements will be advised and precluded from registering in any courses other than those required for a timely graduation."
    },
    {
        "id": "42",
        "title": "Academic Standing",
        "description": "In order to graduate, students must be in good academic standing, earning a cumulative 3.0 minimum GPA in their SJSU graduate record. Review catalog information for more details: Academic Standing."
    },
    {
        "id": "43",
        "title": "Degree Program GPA",
        "description": "Title V (CCR 40510) requires a minimum 3.0 grade point average for all courses to satisfy graduate degree program requirements. Students must maintain a 3.0 GPA in graduate degree program (candidacy form). The program is defined as completed courses included in the original graduate degree program plus all additions or substitutions. View Graduation Requirements in University Catalog."
    },
    {
        "id": "44",
        "title": "Program Courses",
        "description": "Graduate students need to complete all courses in their graduate degree program (approved candidacy form) with grades between A and C, or CR. Grades of C- or lower, including NC, IC and WU, are considered to be unsatisfactory. Visit Catalog Information for both Graduation Requirements and Repeat Policy. Time Limit Note: Graduate students should acknowledge their course time limits for their respective programs and strive to complete all program courses within this time limit. *Please note that if a course listed on the approved candidacy form is not taken, a Request for Course Substitution form must be submitted prior to graduation to prevent a delay in awarding the degree."
    },
    {
        "id": "45",
        "title": "Program Culminating Experience",
        "description": "Each student will also need to complete an acceptable Culminating Experience: thesis, project or comprehensive examination, doctoral project or dissertation. Master's Programs: The thesis (Plan A) or creative work (Plan C) requires that a copy to be submitted to the Associate Dean for the College of Graduate Studies. In Plan B, completed projects are submitted to the student program department directly. In addition, Plan B students may be required to successfully complete a final comprehensive oral and/or written examination. Visit the university catalog for detailed information: Master's Culminating Experiences. Doctoral Programs: A doctoral project proposal must be approved by program faculty. The doctoral dissertation requires submission to Graduate Studies. Visit the university catalog for detailed information: Doctoral Culminating Experiences. Continuous Enrollment Note: All culminating graduate students must maintain continuous enrollment until degree completion."
    },
    {
        "id": "46",
        "title": "Program Final Grades",
        "description": "All grades must be final on the student's transcript in order to award the degree. Failure to clear incomplete (I), report-in-progress (RP), or report-delayed (RD) grades will prevent graduation. Visit the university catalog to view information about Incomplete Grades, Credit/No Credit, and Graduation Requirements."
    },
    {
        "id": "47",
        "title": "Graduation Date Change Request",
        "description": "If you are unable to complete all coursework listed on your candidacy form and all degree requirements by the term you had previously applied to graduate, you can change your graduation date by submitting a Graduation Date Change Request. Note: If your application for graduation is reviewed and your degree is not awarded, you will be required to submit a Graduation Date Change Request. You will not be able to enroll in coursework or 1290R until the form has been received and processed by the GAPE office. International Students Note: If you need to apply for an F-1 Extension of Program, visit ISSS Current Students Website for more information"
    },
    {
        "id": "48",
        "title": "Course Time Limits",
        "description": "Graduate students must complete their degree program requirements within their appropriate time limit. Doctoral Students: Courses may be no older than 5 yearsMaster Students: Courses may be no older than 7 years To review the full Time Limit policy pertaining to your graduate degree, please visit the respective section of the Academic Catalog: Doctoral | Master If a course becomes outdated, students have the following options:"
    },
    {
        "id": "49",
        "title": "Continuous Enrollment",
        "description": "All graduate students are required to maintain continuous enrollment between completion of regular coursework and satisfactory completion of the culminating experience. Students must enroll in either 1290R (an inexpensive one unit option) or repeat their thesis or project course every Fall and Spring semester until their degree is awarded. Enrollment Appointments for 1290R are set by the Registrar's office after the deadline to drop/add courses for the semester and will appear as Special Session appointments in the student's MySJSU portal. Students are able to enroll retroactively in 1290R through the Retroactive Request for 1290R form found on the Registrar office's forms page."
    },
    {
        "id": "50",
        "title": "Commencement Messages",
        "description": "Eligible students receive a registration email to their preferred email address on file with the university with a unique registration link for their ceremony. Ensure your preferred email is updated in your MySJSU portal for timely commencement messages. Please visit the Commencement website for more information."
    },
    {
        "id": "51",
        "title": "Commencement Participation",
        "description": "Graduates are required to register for their Commencement ceremony. If you have applied for graduation, you will receive an email with registration instructions. Visit the commencement website for ceremony information. The Frequently Asked Questions page is a helpful resource to initially defer to for more specific event questions. If you have further questions, please reach out to the Commencement office at commencement@sjsu.edu."
    },
    {
        "id": "52",
        "title": "Event Details",
        "description": "Commencement is a ceremony held twice a year at the end of the Fall and Spring semesters in order to recognize students who are at the completion of their academic degree requirements. Commencement differs from graduation as it solely refers to the recognition ceremony, whereas graduation is the actual award or conferral of a student degree. Along with messaging you will receive regarding Commencement through your MySJSU account, students are encouraged to visit the Commencement website to discover more details about the event. The Frequently Asked Questions page is a helpful resource to initially defer to for more specific event questions. The ceremony is managed by our Commencement Team. For further information, please contact their office at commencement@sjsu.edu."
    },
    {
        "id": "53",
        "title": "International Graduates: Requesting a Visitor Visa",
        "description": "The university does not provide invitation letters for relatives to visit for the commencement ceremony. However, you are welcome to request a Pending Degree Verification Letter from the Registrar's Office. Along with the Registrar's Pending Degree Verification Letter, you can also provide a personal letter of support. Visit the ISSS Form Page for a suggested letter template ."
    },
    {
        "id": "54",
        "title": "Graduation Review Process",
        "description": "The Graduate Admissions and Program Evaluations (GAPE) Office conducts a Graduation Review at the end of each semester for each student who has applied to graduate for that term. The review period is typically set to commence once Academic Standing has been posted by the Registrar Office, but may not occur before. Please visit the Academic Calendar to verify when you may expect a review to begin for your graduating term. The GAPE Review includes an in-depth review of your records for set University Graduation Requirements. We will review for the following graduation requirements.  A minimum 3.0 cumulative GPA in your Graduate Record on your transcript A minimum 3.0 degree program GPA as listed on your Candidacy Form All program courses are completed with grades between A and C, or CR Successful completion of your approved culminating experience  Continuous Enrollment as a culminating student All Final Grades listed on your SJSU transcript You may visit the Academic Catalog to view the Graduation Requirements pertaining to your specific degree: Doctoral | MasterNote: Graduate students are not eligible for Latin Honors. Should your Graduation Review timeline pass, and your degree has not been awarded, please contact your designated GAPE Program Evaluator."
    },
    {
        "id": "55",
        "title": "Graduation Review Timelines",
        "description": "We recognize the significance of your academic accomplishment, however it is important to note awarding a degree is a manual process. As each GAPE Program Evaluator will be reviewing for a high volume of students every semester, please allow some time for processing. The estimated review timeline for each semester Graduation Review period are as follows: Fall Graduation (December) - January to FebruarySpring Graduation (May) - June to JulySummer Graduation (August) - Late August to September Students have two immediate options for receiving the most current status of their degree during their review period:"
    },
    {
        "id": "56",
        "title": "Graduate Diploma",
        "description": "Upon completion of our Graduation Review, your diploma will typically be mailed 4-6 weeks after your degree has been posted. As your diploma will be sent to your listed MySJSU mailing/diploma address, it is pertinent that you keep your preferred mailing/diploma address up-to-date. If you plan to move following graduation please be sure to: Note: Once your diploma has been packaged, we are unable to make any updates to your mailing address or reroute the destination of your diploma."
    },
    {
        "id": "57",
        "title": "Student Services",
        "description": "College of Graduate Studies (CGS) The College of Graduate Studies implements the University graduate policies and procedures. In addition, the College of Graduate Studies provides guidance for thesis and dissertation submission and review. graduate-studies@sjsu.edu408-924-2447 Graduate Admissions and Program Evaluations (GAPE) The Graduate Admissions and Program Evaluations (GAPE) office processes advancement to candidacy and graduation. graduate@sjsu.edu 408-283-7500, Prompt 3 Bursar Office The Bursar Office collects student tuition and fee payment, and disburses funds. bursar@sjsu.edu 408-924-1601 Financial Aid and Scholarship Office (FASO) The Financial Aid Office assists students in securing federal, state, and university financial aid. fao@sjsu.edu 408-283-7500 Office of the Registrar The Office of the Registrar oversees course registration, grade posting, and academic records. registrar@sjsu.edu 408-283-7500"
    },
    {
        "id": "58",
        "title": "Campus Student Organizations",
        "description": "Alumni Association The San Jose State University Alumni Association connects graduates to their alma mater and each other. alumni@sjsu.edu 408-924-6515 Associated Students (Student Life) Associated Students supports and represents SJSU student body through leadership advocacy, programs, events, and funding. as-info@sjsu.edu 408-924-6242 Student Involvement (Student Organizations) Student Involvement oversees all fraternities, sororities, clubs, and other student organizations at SJSU. They host campus events and leadership programs. getinvolved@sjsu.edu 408-924-5950"
    },
    {
        "id": "59",
        "title": "Academic Advising and Research Support",
        "description": "Graduate Program/Department Advising Each major/program has a graduate student advisor to guide students in their academic career. Office of Research and Innovation The Office of Research and Innovation provides a variety of services related to research, scholarship, and creative activities, including proposal development and submission, post-funding award support, and help ensuring ethical and regulatory standards. OfficeofResearch@sjsu.edu 408-924-2272 Dr. Martin Luther King, Jr. Library The Dr. Martin Luther King, Jr. Library serves as a library resource to the campus and greater San Jose community. 408-808-2000 Writing Center The San Jose State University Writing Center offers resources to help students become better writers, and all services are free for SJSU students. writingcenter@sjsu.edu 408-924-2308"
    },
    {
        "id": "60",
        "title": "Technology Support",
        "description": "The AS Print and Technology Center provides printing, copying and technology services. Technology services include mobile phone and computer repair, laptop rental, and data backup. printshop@sjsu.edu 408-924-6976 Information Technology GroupThe Information Technology group provides students with access to the following services: IT Service DeskThe IT Service Desk Staff help students, faculty and staff with all their technical needs. itservicedesk@sjsu.edu 408-924-1530 Equipment LoaningItems such as laptops, cameras, PA systems, USB microphones, digital recording devices may be checked out by students for a limited period of time. Video & Media Services Video and Media Services facilitates Video Conferencing and Media Loans (DVD and VHS). Media Loaning/Instructional and Meeting Spaces Students may view a video assignment in one of three media viewing rooms located in MLK Library."
    },
    {
        "id": "61",
        "title": "Career Services",
        "description": "The Career Center supports graduate students as they explore how their graduate degree can lead to a wide range of career possibilities and opportunities. The Career Center helps graduate students through: Career Counseling: one-on-one appointments with a graduate career counselorEvents: workshops and programs designed specifically for graduate studentsResources: career planning toolscareerhelp@sjsu.edu408-924-6031 International Student and Scholar Services (ISSS) ISSS assists international students in securing OPT, CPT and STEM OPT employment. international-office@sjsu.edu408-924-5920"
    },
    {
        "id": "62",
        "title": "International Students",
        "description": "International Student and Scholar Services centralizes immigration advising resources and co-curricular support programming for international students. It serves the needs of our international students and scholars by enhancing their experience in the United States and integrating them into the SJSU community, while also contributing to their success at SJSU and beyond. international-office@sjsu.edu 408-924-5920 International House (I-House) I-House provides a diverse and welcoming intercultural living environment. It is home to a community of U.S. and international students attending San Jose State University. ihouse@sjsu.edu 408-924-6570"
    },
    {
        "id": "63",
        "title": "Equity and Inclusion",
        "description": "The Accessible Education Center provides comprehensive services that support the educational development and success of students with disabilities. aec-info@sjsu.edu 408-924-6000 voice/408-924-5990 TTY African-American/Black Student Success Center The African American/Black Student Success Center is the hub for Black student life at SJSU. It provides cultural programming, professional development, and academic initiatives that promote community building and student success. africanamericanblackssc@sjsu.edu 408-924-5105 Chicanx/Latinx Student Success Center The Chicanx/Latinx Student Success Center provides a community gathering space, as well as programs and services to support the success of all Chicanx and Latinx students at SJSU. chicanxlatinxssc@sjsu.edu 408-924-5102 Gender Equity Center The Gender Equity Center (GenEC) advocates for social justice, respect, and safety for all members of the San Jose State University community, by educating on issues experienced by people because of their gender, gender identity, and/or their perceived gender/gender identity, through an intersectional lens. genec@sjsu.edu408-924-6500 Veterans Resource Center The San Jose State University Veterans Resource Center is a one-stop resource center that supports all veterans, reservists, guard members, active duty personnel, and veteran dependents. veterans@sjsu.edu 408-924-8129 MOSAIC Cross Cultural CenterThe MOSAIC Cross Cultural Center provides a safe and welcoming environment that honors and celebrates diversity. The center offers support and advocacy for historically underrepresented groups. mosaic@sjsu.edu 408-924-6255 PRIDE Center The PRIDE Center supports the LGBTQ+ (Lesbian, Gay, Bisexual, Transgender, Intersex, Queer, Questioning, Asexual, Nonbinary, etc.) students of San Jose State University. The center seeks to improve the campus climate for LGBTQ+ students and advocate for the respect and safety of all members of the campus community.sjsupride@gmail.com 408-924-6976 UndocuSpartan Student Resource Center The UndocuSpartan Student Resource Center (USRC) uses a cross-cultural and social justice lense to provide holistic support and resources to undocumented students and the campus community. undocuspartan@sjsu.edu 408-924-2762"
    },
    {
        "id": "64",
        "title": "Counseling and Advocacy",
        "description": "CAPS provides students with counseling services on a variety of psychological and academic issues. Professionally trained psychologists, social workers, and counselors are available for students on an individual, couple, or group basis for counseling. counseling.services@sjsu.edu 408-924-5910 Crisis Line Students may call the CAPS Crisis Line to speak to a counselor Monday through Thursday from 8:30 am - 5:30 pm during fall and spring terms, and Monday through Friday from 8:30 am to 4:30 pm during winter and summer terms. 408-924-5910 After-Hours Crisis Line Students may call the CAPS Crisis Line to speak to a counselor after hours. When calling, choose option # 4. 408-924-5910 (Ext 4) Ombudsperson (Grievances/Grade Disputes) The University Ombudsperson is an advocate for procedural fairness who supports the integrity of the campus policies and procedures and ensures the equity of their application. The Ombudsperson provides a neutral, confidential, and informal place to discuss a concern with the assurance that no action will be taken, nor will the visit be disclosed to anyone, without consent. ombuds@sjsu.edu408-924-5995"
    },
    {
        "id": "65",
        "title": "Health and Wellness",
        "description": "Spartan Recreation and Aquatic Center Spartan Recreation helps students kick off or maintain a healthy, active lifestyle through an exciting selection of activities in state-of-the-art facilities. Their offerings include the Bowling Center, Fitness Classes, Club Sports, Intramural Sports, Outdoor Adventures, and a Climbing Wall. 408-924-6368 Student Health Center The Student Health Center provides health care services, including basic primary care, limited specialty care, health promotion and disease prevention, principal support services (laboratory, pharmacy, physical therapy, radiology, nutrition), and limited mental health services. 408-924-6122"
    },
    {
        "id": "66",
        "title": "Housing, Dining and Transportation",
        "description": "University Housing Services (UHS)On-Campus Housing is available to provide support to new Graduate Students seeking housing in the Bay area. uhs-frontdesk@sjsu.edu 408-795-5600 International House (I-House)I-House provides a diverse and welcoming intercultural living environment. It is home to a community of U.S. and international students attending San Jose State University. ihouse@sjsu.edu 408-924-6570 Spartan Eats Campus Dining Spartan Eats manages SJSU meal plan options and on campus dining.408-924-1740 Parking ServicesParking Services provides a clean and safe parking environment for students, faculty, staff and visitors. Students have the option of purchasing either a semester permit or a single-day permit to park at SJSU. parking@sjsu.edu408-924-6566 Transportation Solutions Transportation solutions assists students seeking transportation alternatives to driving an automobile to campus alone. They offer SmartPass/Clipper Cards for VTA bus and light rail, and assistance for students using carpools, bicycles, and public transit. transportation@sjsu.edu 408-924-7433 Maps/Directions to SJSUSan Jose State University provides maps and directions to campus from a variety of locations."
    },
    {
        "id": "67",
        "title": "Safety, Security and Emergency Support",
        "description": "After-Hours Crisis LineStudents may call the CAPS Crisis Line to speak to a counselor after hours. When calling, choose option # 4. 408-924-5910 (Ext 4) Behavioral Intervention Team Students can report concerning behaviors of those in our campus community including students, faculty members, staff or SJSU visitors, to the Behavioral Intervention team. 408-924-6339 University Police Department (UPD)San Jose State University police department works 24 hours a day, 7 days a week, to provide a safe and secure learning environment through professional, progressive and superior police, emergency, transportation and educational services.408-924-2222 (non-emergency)911 (emergency)Blue Light/Elevator Phones (emergency) Alert SJSU The campus emergency communication system, Alert SJSU, provides critical information about what to do and where to go during a natural disaster or life-threatening emergency through text, email, phone and TTY/TDD messages. Safety Escort ProgramIn the event a student feels unsafe walking on campus, UPD will provide an escort to any location on campus and up to two blocks from campus. The service is available 24 hours a day, 7 days a week.408-924-2000or use Blue Light/Elevator Phone TipNow Anonymous Crime Reporting The TipNow text and email system lets students provide important crime information to UPD using a cell phone or PDA device. It sends an anonymous message to on-duty police personnel any time day or night.sjsu@tipnow.org408-337-2919"
    },
    {
        "id": "68",
        "title": "SJSU Cares",
        "description": "SJSU Cares SJSU Cares provides support and referrals around basic needs including food, housing, and emergency assistance. sjsucares@sjsu.edu408-924-1234 Spartan Food Pantry The Spartan Food Pantry offers non-perishable goods, fresh produce, and refrigerated items to students facing food insecurity."
    },
    {
        "id": "69",
        "title": "Change F-1 Status",
        "description": "The following information is intended for admitted SJSU students currently in the United States. New or Current Students After you have been admitted to SJSU, if you want to change your nonimmigrant status to F-1, we recommend that you plan ahead. Below is a summary of available options. If you are admitted to SJSU in your current nonimmigrant status, such as H-4, F-2, E-2, L-2, etc., it is your responsibility to know if you can study in your current status. See this ICE handout Nonimmigrants: Who Can Study. If you have not been admitted to SJSU, please wait until you have been officially accepted by the University and received your admit letter before applying for a change of status. ISSS does not provide admission counseling or advice. Per University policy, non-resident tuition fees are charged from the I-20 issuance date. Ways to obtain F-1 status. View this Comparison Chart. By Travel or Consular processing. You will need to depart the U.S., apply for an F-1 visa at a U.S. Embassy or Consulate, preferably in your home country. Fill out and submit a Change of Status I-20 Request form to ISSS. Apply for an F-1 visa at a U.S. Embassy or Consulate abroad. To re-enter the U.S. apply for F-1 admission at a U.S. Port of Entry. You will need to enter within 30 days of the program start date listed on your I-20. File Form I-539, Change of Status application with U.S. Citizenship and Immigration Services (USCIS). Fill out and submit a Change of Status I-20 Request form to ISSS. Prepare and submit your Form I-539 COS application to USCIS along with a copy of the COS I-20 and supporting documentation. See USCIS or Study in the States website for more COS to F-1 information. Check USCIS Processing Time for Form I-539s here. Students filing a COS application with USCIS have the option to file for Premium Processing at the time of application or by adding it to their pending application (by filing the I-907). USCIS will take adjudicative action within 30 days or will refund Premium Processing fee. Processing Time Questions to consider: How soon do you want to become an F-1 student? When did you start your academic program? Are you in the first semester of your degree program or near the end of your program? Changing your nonimmigrant status to F-1 status will take time. Depending on the route you select, you will need to plan ahead. Expect delays either with obtaining your F-1 visa stamp, or you may experience prolonged COS processing times with USCIS. ISSS highly recommends that you start the change of status process early in your academic career, optimally with at least two semesters or more remaining in your degree program. Financial implications. Are you currently eligible for in-state tuition or have an exemption/exception to payment of non-resident tuition? All F-1 students pay the non-resident tuition rate. Per University policy, non-resident tuition fees are charged from the I-20 issuance date. In addition, F-1 students are required to purchase University-sponsored health insurance. You will need to factor in any travel costs in and out of the U.S. and visa application fee(s) if you choose the consular processing option. Alternatively, if you choose the USCIS option, consider the filing fee for Form I-539 Change of Status, plus biometrics, or additional fee(s). Intent or Motivation. Are you willing to pursue full-time studies? F-1 students are required to be enrolled in a full course of study during the academic year. Off-campus work benefits such as Curricular Practical Training or Optional Practical Training are not guaranteed and should not be the primary reason(s) for you to convert to F-1 student status. Application Steps Fill out and submit a Change of Status I-20 Request form to ISSS. Indicate which option you will pursue to convert to F-1 status. Allow at least 15 business days for processing. We will contact you when the I-20 is ready. Financial documentation See the Declaration of Finance form for the required funding amounts and acceptable funding sources. Bank letters or statements must be dated within the past six months, must be in English, balance listed in U.S. dollars. For the USCIS COS application, we recommend you submit additional 3-4 consecutive bank statements with a monthly balance in the required amount. Current immigration documents Copy of your passport, visa, and I-94 record of arrival Copy of the principal visa holder passport, visa, I-94, or Form I-797A Notice of Action, if applicable Admit Letter If you have already started your studies at SJSU, provide a letter from your graduate advisor or an individualized academic or program plan with the expected graduation or degree completion date. This will determine your I-20 program end date. After you have received your I-20, check for any errors, sign, and date the document. Prepare and gather your remaining paperwork depending on the option below: Checklist for Consular Processing Checklist for USCIS Change of Status Deadline to request an I-20. No matter which option you choose, understand that converting to F-1 student status takes time. There are many steps for you to complete. Commit to one option. Plan ahead. Expect travel or visa application-related delays or longer processing times at USCIS. ISSS cannot guarantee you an F-1 visa or a change of status to F-1 approval within your preferred timeline. You must maintain your current nonimmigrant status to be eligible to remain in the U.S. Have a contingency plan in the event that your change of status or your F-1 visa is not approved. Requested F-1 Start Date Fall Semester No later than July 15 Spring Semester No later than December 15 Employment If you are interested in learning about the employment options available to F-1 students, select On-Campus, Curricular Practical Training, or Optional Practical Training under the Current Students tab on the ISSS website. Keep in mind that you must be in valid F-1 status to benefit from the employment options for students. For off-campus employment (CPT, OPT) there is the additional requirement of completing one academic year of full-time studies. Please refrain from inquiring about CPT or OPT work authorization or be in the process of applying for jobs if you do not have the proper F-1 status yet."
    },
    {
        "id": "70",
        "title": "J-1 Department Process",
        "description": "The J-1 Exchange Visitor (EV) program promotes mutual understanding between the United States and other countries by means of educational and cultural exchange. The EV program provides foreign nationals with valuable opportunities to experience the U.S., thereby developing lasting and meaningful relationships. For more information visit: j1visa.state.gov. Eligibility Institutional Requirements. The department must extend an academic appointment to the prospective J-1 exchange visitor. The academic appointment may be a courtesy appointment or a paid position. Regulatory Requirement. A prospective exchange Professor, Short-Term Scholar, or Research Scholar is expected to have completed at least a bachelor's degree with appropriate experience in the field in which research or teaching is to be conducted. A J-1 Professor or Research Scholar cannot hold tenure or be placed in a position \"on a tenure track.\" Obligations** The department or faculty sponsor will provide assistance to the Exchange Visitor (EV) upon arrival at SJSU. The proposed activity is suitable for the EV's background, needs, and/or experience. The exchange visitor and any family members are required to have sufficient funding for their period of stay. The EV is aware of the health insurance requirement and is clear as to who is responsible for paying for insurance premiums. The EV will engage only in activities that are consistent with the intended program while at SJSU. Inform ISSS when conditions of financial support change, there is a position or appointment title change, early completion or termination of program, or the EV will be outside the U.S. for more than 30 days. In addition, the Faculty Sponsor ensures that the Visiting Scholar is engaged and is part of departmental meetings, is integrated into the department and meets the Dean. Faculty Sponsors Submit new or renewal college request and application materials to the Department Chair. This would be a brief description of how the visit aligns with the college policy requirements or alternatively write a brief description of the scholar intent of visit. Other required items include the following: Collect Visitor CV Draft College Invitation Letter using College template letter this letter should include what support if any, the department is offering to the scholar the duration of the visit (exact dates) the name of the PI/faculty member with whom the scholar will be collaborating Contact University Personnel(UP) and follow up to receive a paid or unpaid appointment letter and to ensure the EV is in the system to be able to receive access to SJSU Email, SJSU King Library privileges/canvas upon arrival. Volunteer/Unpaid Visiting Scholar Appointment Information can be found here. Please initiate the international visiting scholar Docusign form. In order to receive UP approval, UP must confirm that EV will have an assigned office space and equipment and access to the space during their visit at SJSU Chair/Directors If the request is approved, forward entire packet to the Dean for review and signature. If the Dean approves the request application, the invitation letter drafted by the department will be added to the college letterhead, scanned and emailed to the department chair and faculty host to send to the visitor, in addition to the invitation letter from UP. Once all the process steps have been met, please contact ISSS and request a DS-2019"
    },
    {
        "id": "71",
        "title": "J-1 Visiting Process",
        "description": "The J-1 Exchange Visitor (EV) program promotes mutual understanding between the United States and other countries by means of educational and cultural exchange. The EV program provides foreign nationals with valuable opportunities to experience the U.S., thereby developing lasting and meaningful relationships. For more information visit: j1visa.state.gov Eligibility Institutional Requirements. The department must extend an academic appointment to the prospective J-1 exchange visitor. The academic appointment may be a courtesy appointment or a paid position. Regulatory Requirements A prospective exchange Professor, Short-Term Scholar, or Research Scholar is expected to meet all of the following requirements: have completed at least a bachelor's degree with appropriate experience in the field in which research or teaching is to be conducted. A J-1 Professor or Research Scholar cannot hold tenure or be placed in a position \"on a tenure track.\" request a DS-2019 for their exchange visitor period. have English language ability is sufficient\"to function on a day-to-day basis\" outside of the direct program activity. provide adequate funding for their program in the United States. have valid health insurance that meets the Department of State requirements for the duration of their program. Pre-Arrival Information Request a DS-2019 Work with your Academic Department or Sponsoring Faculty member to initiate the request for a DS-2019. Once the DS-2019 has been issued by International Student and Scholar Services (ISSS), then you will need to move on to the next pre-arrival steps. Certifying Your Exchange Visitor (EV) Program By signing the DS-2019 (Certificate of Eligibility for Exchange Visitor) you obligate yourself to all terms and conditions stated on page two of the form. Do the following: Check for Errors: Notify ISSS if there are any errors on your DS-2019 before you apply for the visa. Read the Regulations on page two of your DS-2019 form. If you understand and agree to the conditions then sign, date, indicate your location in the Exchange Visitor Certification block on the bottom of page 1. The J-2 spouse/dependent should sign the J-2 form under Signature of Applicant unless the J-2 dependent is under the age of 14, in which case the J-1 parent must sign. Student and Exchange Visitor Information System (SEVIS)J-1 EV and dependent records are housed in the Student and Exchange Visitor Information System (SEVIS). Each scholar and dependent is given a unique SEVIS ID number. SEVIS is an internet-based system that provides tracking and monitoring functionality. SEVIS enables schools and program sponsors to transmit electronic information, report, and access accurate and current information throughout a student or exchange visitor stay in the United States. Applying for the J Visa Review the Department of State website for detailed information about applying for J-1 visa. There are several steps to apply for a visa. The order and how you complete them vary by U.S. Embassy or Consulate. Consult the instructions on U.S. Embassy or Consulate website. Pay the I-901 SEVIS Fee ($180). After fee payment print yourself a receipt. The SEVIS fee does not need to be paid for J-2 dependents or visa renewals. Complete the Online Nonimmigrant Visa Application (Form DS-160), upload a photo, and pay DS-160 application fee. Schedule an appointment for your visa interview at the nearest U.S. Embassy or Consulate. Note: Canadian citizens do not need to apply for a visa at a U.S. consulate or embassy. Canadians will need to present the I-901 SEVIS fee payment receipt, valid passport, DS-2019 form, and San Jose State University appointment/invitation letter to a Customs and Border (CBP) official at the U.S. Port of Entry to request permission to enter the U.S. in J-1 status. Entering the United States J-1/J-2 exchange visitors may enter the U.S. up to 30 days before the program begin date listed in section three of the DS-2019 form. Present a valid passport, J-1/J-2 visa, and DS-2019 to a Customs and Border (CBP) official at the U.S. Port of Entry (POE) to request permission to enter the U.S. The scholar should also have ready the I-901 SEVIS fee payment receipt and San Jose State University appointment/invitation letter as supporting documentation. If admitted, the CBP officer will stamp your passport. It is good practice to check the admission stamp for J-1 D/S notation to indicate you are being admitted in J-1 status. You will be given information about retrieving an electronic I-94 admission record. Program Delays and Cancellations Delay of Program: If you are not able to arrive to begin your program by the intended start date or need to change the program start date, please notify your faculty sponsor, Academic Department, and International Student and Scholar Services (ISSS) immediately at international-office@sjus.edu. ISSS will confirm with the sponsoring department before making any changes to the program start and end date. If the program start date is amended, a new DS-2019 will be issued and emailed to you. Cancellation of Program: If you are unable to obtain a visa or participate in the program please notify the sponsoring Academic Department, and International Student and Scholar Services (ISSS) immediately at international-office@sjus.edu. ISSS will cancel the J-1 and any J-2 SEVIS records/DS-2019's."
    },
    {
        "id": "72",
        "title": "Maintaining F-1 Status",
        "description": "Enrollment Requirements Pursue a full course of study (i.e., 12 units for UGRD and 9 units for GRAD). Unless authorized by ISSS for Reduced Course Load Concurrent Enrollment Culminating Experience Be mindful of allowable online credits. Only one course or 3 units per a student's full-time enrollment can be online. The other remaining courses must be in-person or hybrid. If you only have one course to complete in your final semester, this course cannot be online. Make progress towards degree completion. Maintain a valid I-20. Know your expiration date. Extend in a timely manner. Shorten - if finishing degree program earlier than expected. Update if major changes. Maintain a valid travel signature. Validity of 12 months, when pursuing degree. Validity of 6 months when on OPT/STEM OPT. Report a change of address within 10 days of moving via MySJSU. Do not engage in off-campus employment (paid or unpaid) without the proper employment authorization (i.e., CPT). Post-Completion OPT Work within the dates of the authorized (EAD) Employment Authorization Document. All employment (paid or unpaid) must be related to your major field of study. Employment must be at least 20 hours per week, in order not to accrue unemployment days. Do not exceed an aggregate of 90 days of unemployment. Report employment via the SEVP portal or directly to ISSS within 10 days. Report a change of address within 10 days of moving via the SEVP portal. Maintain a valid travel signature. Validity of 6 months, when on OPT. STEM OPT All employment must be for an e-verified employer, related to your major field of study, paid, and at least 20 hours per week. Report employment and changes in employment within 10 days of the change, via the STEM OPT Employment Update e-form. Reporting requirements at the following times: 6 months, 12 months, 18 months, 24 months. Maintain a valid travel signature. Validity of 6 months, when on STEM OPT. Do not exceed 150 days of unemployment, applied to the entire period of standard Post-completion and STEM OPT."
    },
    {
        "id": "73",
        "title": "Accessible Education Center (AEC)",
        "description": "The Accessible Education Center (AEC) proudly presents its vision of redefining ability at San Jose State University by providing comprehensive services in support of the educational development and success of student with disabilities."
    },
    {
        "id": "74",
        "title": "Black Leadership & Opportunity Center",
        "description": "The hub for Black student life at SJSU. We provide cultural programming, professional development and academic initiatives that promote community building and overall student success."
    },
    {
        "id": "75",
        "title": "Career Center",
        "description": "The SJSU Career Center is an excellent resource for finding internships and jobs and polishing the skills you need to find a rewarding career in your field."
    },
    {
        "id": "76",
        "title": "Center for Asian Pacific Islander Student Empowerment",
        "description": "Provides community-building and cultural and academic empowerment opportunities for Asian and Pacific Islander students at SJSU."
    },
    {
        "id": "77",
        "title": "Chicanx/Latinx Student Success Center",
        "description": "Provides a community gathering space as well as programs and services to support the success of all Chicanx and Latinx students at SJSU."
    },
    {
        "id": "78",
        "title": "Counseling & Psychological Services",
        "description": "Free Counseling services for all SJSU students. Whether you are struggling with stress, depression, anxiety or relationship problems, Counseling and Psychological Services is here to provide the support you need to succeed at SJSU. In our current state of remote online instruction, CAPS is providing services through confidential telehealth with limited in-person services."
    },
    {
        "id": "79",
        "title": "Financial Aid",
        "description": "The SJSU Financial Aid and Scholarships Office (FASO) can help you and your family get the money you need through federal and state grants as well as loans, scholarships, and work-study programs."
    },
    {
        "id": "80",
        "title": "Gender Equity Center",
        "description": "The mission of the Gender Equity Center (GenEC) is to advocate for social justice, respect, and safety for all members of the San Jose State University community, by educating on issues experienced by people because of their gender, gender identity, and/or their perceived gender/gender identity, through an intersectional lens."
    },
    {
        "id": "81",
        "title": "Guardian Scholars",
        "description": "Provides holistic support services for former and current foster youth, wards of the court, unaccompanied homeless youth, and youth under legal guardianship."
    },
    {
        "id": "82",
        "title": "MOSAIC Cross Cultural Center",
        "description": "Provide a safe and welcoming environment that honors and celebrates diversity. We offer support, advocacy for historically underrepresented groups, leadership opportunities, and intentional programming that focus on critical thought, social justice, and cultural empowerment for the SJSU community."
    },
    {
        "id": "83",
        "title": "Peer Connections",
        "description": "Supports students through tutoring, mentoring, supplemental instruction, learning assistants, and student success events in an inclusive, welcoming environment. It serves as a university-wide resource for the promotion of peer learning and retention."
    },
    {
        "id": "84",
        "title": "PRIDE Center",
        "description": "The PRIDE Center is here to support and advocate for all members of the LGBTQIA+ community, so that students feel safe, welcomed, and respected on campus. If you are looking for personal or academic support, the Center hosts a wide variety of resources to help you achieve your goals."
    },
    {
        "id": "85",
        "title": "Student Wellness Center",
        "description": "The role of the SJSU Student Wellness Center is to support the university by providing medical services to all registered students."
    },
    {
        "id": "86",
        "title": "UndocuSpartan",
        "description": "Committed to creating an informed and affirming learning environment for undocumented students where they can be empowered and engage in transformational opportunities that support their personal, academic, and career growth."
    },
    {
        "id": "87",
        "title": "Veterans Resource Center",
        "description": "One-stop resource center proudly supporting all veterans, reservists, guard members, active duty personnel and veteran dependents."
    },
    {
        "id": "88",
        "title": "Networking",
        "description": "Networking\n70% of jobs are found through networking (Payscale, 2017 ). This is due to a number of reasons:\n  80% of jobs are never posted.\n  40% of new hires are from referrals, despite them being only  7% of all applicants.\n  75% of resumes never make it to the hiring manager because they are screened out by applicant tracking systems.\n(Infographic from Jobvite, 2012 )\nNetworking is all about developing relationships. While it can often be intimidating at first, think about networking as building genuine connections with others.\nMYTH #1: Networking is for extroverts.\nIntroverts can be often be just as effective at networking as extroverts, but may use different strategies to achieve the same goals. For example, one way to network is to reach out to alumni through LinkedIn and set up an informational interview with a professional in your career field of interest.\nMYTH #2: Networking should start when you are looking for a job/internship.\nNetworking takes time and requires follow up. Don wait until you need a job/internship to start networking because this often appears disingenuous. Start building your network early on by showing a genuine interest in learning about your industry.\nMYTH #3: The main goal of networking is to get me a referral for a job/internship.\nNetworking is a great way to gain industry knowledge, find mentors, and grow professionally . While getting a referral for a job/internship is certainly very helpful, it should not be your number one goal. So get out there and start networking! Here are some ways to build your network:\n Join a student organization\n Join a professional organization\n Join industry-related groups on LinkedIn\n Attend job/internship fairs at SJSU\n Attend infosessions and tech talks at SJSU\n Attend industry events/conferences\n Attend a professor office hours\n Created a LinkedIn account\nTIP: Not sure how to reach out to someone you would like to connect with? MangoConnects  is a free tool that helps you draft customized, professional networking emails."
    },
    {
        "id": "89",
        "title": "Using LinkedIn",
        "description": "Utilizing LinkedIn\nLinkedIn.com  is a great tool for online networking. Not only is it useful for connecting with people in the industry, LinkedIn also allows you to showcase your experience and skills.  80% of recruiters use LinkedIn to evaluate candidates when hiring ( Jobvite, 2016 ).\nMaking Connections\nYou probably know more people than you think. Start by adding your friends and family. Then, add your peers and colleagues.\nTo find alumni, search San Jose State University and select See alumni. From there, you can filter alumni by where they work, what they do, and what they studied.\nTo connect with an alum you do not know, request to add him/her and send a personalized message such as:\nHi, my name is Sammy Spartan. I currently a junior at SJSU studying business, and noticed you were a recent alum of the program. I would love to connect with you as a fellow Spartan.\nExpand your network by joining professional organizations and groups. There may already be a LinkedIn group for your major. Finally, follow any target employers to stay updated on opportunities and relevant news.\nBuilding Your Profile\nYour LinkedIn profile is like an expanded resume - instead of being tailored to a specific opportunity, it is a portfolio of your experiences, skills, and work. Here are some tips for creating a great LinkedIn profile:\n Claim your LinkedIn URL at linkedin.com/in/\nyourname by selecting Edit public profile & URL on the right hand side. Include this URL on your resume so employers can find you easily.\n Include a professional headshot. Don have one? Check out our Profile Photo Booth at the SJSU Career Center.\n Create your brand by utilizing the headline and summary sections. Highlight your key skills and what types of opportunities you are looking for.\n Make it dynamic by adding work samples, photos, personal websites, blog feeds, and/or relevant social media.\n Use industry keywords. If you aren sure what they are, look at other professionals' profiles, especially at companies you want to work.\n List transferable and technical skills. These skills can be scanned by recruiters on LinkedIn.\n Utilize the social aspect by asking for recommendations and endorsements.\n On the Career interests box, turn the option Let recruiters know you're open on.\n Fill out 100% of your profile.  This increases your chances of being seen by a recruiter.\nFor more help, check out the LinkedIn for Students resource page."
    },
    {
        "id": "90",
        "title": "Informal Interviews",
        "description": "Conducting an Informational Interview\nAn informational interview is an arranged meeting or phone call with someone who works in an industry or company you are interested in. It can help you gather specific information about a job, industry, or company. Remember that you are not asking for a job.\nSetting Up an Informational Interview\nBefore you contact someone, establish your objective. What is it you hope to gain? Who do you want to interview and why? Once you have an idea of your goal, determine who you want to contact. You can find alumni or other industry professionals to connect with through:\nQuick Connections on SJSU Mentoring & Meetups\nQuick Connections is a way to engage with alumni or other professionals for a one-time career conversation which also known as an informational interview. All alumni or other professionals on this platform have voluntarily signed up to mentor Spartans. Here is how to access: 1. Go to  https://sjsu2.peoplegrove.com/\n2. Login using your SSO and complete your profile 3. Select the Quick Connections  tab\n4. Search for alumni/professionals by using the filters or search bar 5. Look at their profile and click on Let Connect and send a message (email) or request a meeting (online video chat, phone, or in-person)\nAlumni Tool on LinkedIn\n1. Go to https://linkedin.com/alumni\n2. Login using your LinkedIn email and password 3. Select the Alumni  tab on the left once on the San Jose State University landing page\n4. Use the search bar and type in keywords such as job title, organizationWhen introducing yourself in the message that you send using Quick Connections on SJSU or LinkedIn, clearly state your objective, for example: Hi, my name is Sammy Spartan. I currently a _____(class year) at SJSU studying _____(major/\ndegree), and noticed on _____(Quick Connections on SJSU or LinkedIn) that you were a recent alum of the program. I would love to meet you in-person or chat over the phone/online for a quick 20-30 minute conversation to ask you some questions about how you got to where you are. Hope to hear from you soon, and thank you for your time! Keep in mind that you are interacting in a professional capacity with someone who might be a future colleague or boss. See The Muse for tips on professional communication etiquette.   Preparing for an Informational Interview\nPrepare questions ahead of time before meeting or calling the person. Below are some suggested questions:\n How did you get into your career?  How did you get into this organization/industry?\n What is a typical day like?  What do you like most about your job?  What are the key skills that one needs to be successful in the field?  What was the biggest challenge you had when transitioning from college to the world of work?  Knowing what you know now, what advice would you give to students to prepare for the workforce?  What professional organizations or resources would be helpful for me to know?\nOn the day of the meeting, dress professionally and be on time. Close the meeting by thanking them for their time. You may also ask a question such as, Do you know of any current opportunities in the field? to let the person know that you are currently looking for opportunities. This may lead to a referral; however, do not assume that the person will give you one. Be sure to follow up with a thank you note or email. If the alum/professional suggests tasks for you to work on or complete, keep them updated on your progress."
    },
    {
        "id": "91",
        "title": "Career Fair",
        "description": "During the Fair\n1. Use the floor map to locate your 5-10 target employers.\n2. Approach non-target employers first to practice your conversation starter and calm your nerves.\n3. When visiting employer booths:\n At booths with long lines, have brief conversations (5 minutes).\n Initiate a handshake with a smile.\n Avoid questions on salary or benefits.\n Offer your resume to the recruiter.\n Ask about the application process and whom to contact for follow up. Do expect to apply online.\n Request a business card or LinkedIn connection if the recruiter is willing to share.\n Shake hands to close.\nAfter the Fair\n1. Send an email thanking the employer for his/her time and reiterating your interest in the role. Include another resume and other application requirements. For more help, see the Thank You Notes section on the Interviewing Guide .\n2. Follow the application process and continue checking job listings on SJSU Handshake.\n3. After you accept an offer, stop interviewing. Instead, plan for success with your new employer.\nAttending Info Sessions\nInfo Sessions are similar to job fairs but will only have one employer. They will typically start with an introduction from the employer representatives on the company and opportunities they are hiring for. Check SJSU Handshake  for upcoming info sessions and prepare for an info session similar to the way you would prepare for a job fair. Be sure to check the event description to find what majors and class years the employer is looking for.Attending Job and Internship Fairs\nJob and internship fairs are a great way to meet multiple employers. These are typically held in the fall and spring. Be sure to attend the Making the Most of the Job Fair workshop to make the most of the event.\nBefore the Fair\n1. Log in to SJSU Handshake  to find information on employers and specific opportunities. Periodically check for new employers and/or opportunities up until the day of the fair.\n2. Select 5-10 target employers that you want to meet. Learn more about the employer by visiting the employer website.\n3. Tailor your resume to specific opportunities/\ncompanies you want to apply for. Prepare a general resume for any additional companies you might be interested in at the fair.\n4. Prepare and practice your conversation starter, as well as questions to ask employers such as What qualities are you looking for? What growth opportunities are available?\n5. Dress professionally in business attire. For more help, see the Interview Attire section on the Interviewing Guide .\n6. Pack your gear: a tidy folder, multiple copies of your resume, a calendar, and your student ID."
    },
    {
        "id": "92",
        "title": "Job/Internship Seach-International",
        "description": "Job/Internship Search\nHow to Find Jobs/Internships\nStart by reviewing the Job/Internship Search Guide . Start your search for on-campus jobs, internships, and full-time jobs with SJSU Handshake  as early as possible. Be sure to update your work authorization  on SJSU Handshake to accurately reflect your status. On the Jobs tab, select Filter, then check US Work Authorization optional  to find relevant opportunities.\n On-Campus Jobs: Besides SJSU Handshake, you can also find on-campus jobs on the Build Experience Guide. Keep in mind that there are more students seeking on-campus work than there are jobs available, and some positions have over 100 applicants. Here are some tips to be competitive:\n Tailor your resume to the job by including the job title in your objective. Focus on transferable skills - specifically customer service, communication, and teamwork, rather than technical skills and experience unless you are applying for a technical on-campus job.  See the on-campus resume sample .\n Internships and Jobs:  Check the SJSU Handshake  calendar for upcoming employer events and job fairs. Be sure to check which majors, class years, and level (undergraduate vs. graduate) the employer is looking for. Below are additional resources to check out:\n MyVisaJobs : H1B work visa database\n US Department of Labor Report : Top employers and occupations with labor certifications\nTips to Be a Competitive Applicant\n Consider culture fit when looking at companies. Culture fit can be a crucial factor in the hiring process. Employees who match the company culture tend to perform better, have increased job satisfaction, and higher retention rates. Think about how comfortable you would be in the work environment and whether your beliefs, values, and needs match that of the company.\n Strengthen your English language skills . Communication, both verbal and written, is one of the top skills employers are looking for. Get help with writing at the SJSU Writing Center .\n Build experience outside of academics. Get involved in student organizations, volunteer at a non-profit, or compete in hackathons and challenges. See our Build Experience Guide  for more ideas.  Highlight your strengths as an international student . Showcase your ability to work in a diverse workplace, help your employer compete in a global economy, and tackle the unknown."
    },
    {
        "id": "93",
        "title": "Resume-International",
        "description": "Resume\nStart by reviewing our Resume/Cover Letter Guide . Note key differences between a US resume and a resume in another country:\n A US resume is a one page summary that highlights relevant skills and experience based on the job description. Resumes are different from CVs, which are used more often internationally . A CV is longer than one page and is a static document that includes an extensive history of your education and experience. In the US, CVs are typically only used for research or academic positions.\n Do not include personal information such as age, gender, marital status, ethnicity, or immigration status. Also do not include a photo or test scores (such as TOEFL).\nHere are some top tips to making your resume stand out:\n Check for spelling/grammar mistakes. You can get help with writing at the SJSU Writing Center .\n Keep your resume to 1-2 pages. Do not try to squeeze as much information in as possible, as this makes it difficult for the recruiter to scan. If you have additional experience that does not fit, include it on your LinkedIn profile.\n Describe your accomplishments. Replace passive phrases such as responsible for with strong action verbs such as led, managed, and collaborated. Quantify your resumes to show the impact of your work.\n Include links to your LinkedIn, website, and/or GitHub account. Use these sites to showcase examples of projects and proof of your work.\n Demonstrate both technical skills and transferable skills such as communication, teamwork, problem solving, and leadership.\n Don focus on just academics.  Include experiences outside the classroom such as involvement in student organizations or volunteer work.\n Provide a frame of reference for experience outside of the US. For example, interned at the #3 fastest growing company in India."
    },
    {
        "id": "94",
        "title": "Networking-International",
        "description": "Networking\nStart by reviewing the networking section in the Job/Internship Search Guide . Here are some tips for networking:\n When first meeting someone, greet with How are you? or How are you doing?\n Prepare conversation starters for small talk such as:\n Student Events: What major are you studying? What year are you?\n Industry Events: What brought you to this event? What do you do?\n Conferences: What session are you most excited about? Is this your first time attenting this conference? How long have you been a part of this organization?\n Avoid controversial topics such as religion, politics and sex. Discussing salary should also be avoided.\n Be aware of cultural differences . Arrive early or on time to events and communicate directly. Maintain an arm length distance from others.\n Use every opportunity to network. Networking doesn have to happen at an event - it is simply connecting with people and can start with your peers, professors, and neighbors.\nHere are some ways you can network with peers and industry professionals:\n Check out Coffee Night  at the SJSU International House, a relaxed social gathering for I-House residents and visitors.\n Join the International Circle Support Group  to connect with other international students, provide support, discuss common challenges, learn information about the U.S., and practice English.\n Join student organizations  on campus such as the Global Student Network. Use the Career Pathways page  to search organizations by industry.\n Join the San Jose State University Students (International Students Group)  on Facebook.\n Practice public speaking skills by joining Spartan Toastmasters.\n Search for industry or interest related events on Eventbrite and Meetup."
    },
    {
        "id": "95",
        "title": "Interviewing-International",
        "description": "Interviewing\nTo prepare for an interview with an employer in the US, review our Interviewing Guide . Here are additional tips for acing the US interview:\n Arrive at least 10-15 minutes early to the interview.\n Dress professionally but appropriate for the company culture. As a general rule, dress a step above would employees would typically wear to a work day.\n Keep personal scents to a minimum. Avoid eating strong smelling foods before the interview.\n Treat everyone you come in contact with with courtesy and respect.\n Be aware of your non-verbal communication. When you first meet the interviewer , give a firm handshake. During the interview, maintain eye contact and show enthusiasm through your tone of voice and facial expressions. Maintain professionalism by having good posture. Respect personal space by keeping about 30-36 inches between you and the interviewer.\n Take an active role in the interview. Be prepared to show why you are the best candidate for the position, elaborate on your responses, and ask questions of the interviewer . This may be different than the interview culture in other countries, where promoting your own accomplishments is discouraged and taking a passive role is expected.\nFor more tips on interviewing, see this article Interviewing Across Cultures  by Pamela Leri, Guest Columnist for Global Global."
    },
    {
        "id": "96",
        "title": "Opportunities-Graduate",
        "description": "Opportunities for  Graduate Students\nAs you embark on your graduate studies, it important that you continue to build expertise and relevant experience in your field of interest. Below is a list of opportunities that can help you in this process. Types of Opportunities  Research Grants : Applying for a research grant typically consists of a competitive application process in which your research proposal may be selected for funding. The grants can vary from small award amounts to covering a full year or multi-year research project.\nFellowships : Short-term learning opportunities, that typically last a few months to two years, that are granted to master or doctoral students based on academic merit to work in a specific field.\nTypes of Fieldwork : Fieldwork allows students to gain experience and improve their skills by working in real-life settings, under the supervision of faculty and/\nor onsite supervisor. There are two types of fieldwork:\n Internships: Relevant experience in your field of interest, can be either part-time or full-time, where your workload and performance will be managed by a supervisor.\n Practicum: On-site, part-time field experience where you get to observe and practice tasks under the supervision of an on-site professional and/or professor.\nIndustry Experience: Part-time or full-time job in your field of interest that allows you to further develop and/or gain skills relevant to your field.\nHow to Find Opportunites\nBelow are some key resources for an academic and non-academic job search.\nAcademic Job Search:\n Chronicle Vitae: jobs in higher education,  career resources, and advice from The Chronicle of Higher Education. SJSU Research Foundation : supports faculty through each step in the research proposal process from planning a project, identifying sources of funding, to developing a grant proposal, and submitting proposals to sponsoring agencies.\n Faculty: connect with faculty to learn about potential opportunities in research or academia.\n Think Tank: research institute, center, or organization that conducts interdisciplinary research focused on topics such as politics, economics, technology, etc.\n U.S. Think Tanks\n Non-U.S. Think Tanks by Region\nNon-Academic Job Search:\n Jobs/internships on SJSU Handshake\n Professional associations/groups:\n LinkedIn\n List of Professional Associations & Organizations by Industry\n Career interest area job boards :\n Arts, Communication, and Entertainment\n Business, Financial Services, and Logistics\n Education and Public & Human Services\n Health and Nutrition\n Science, Technology, Engineering, and Math\n Other job boards:\n Indeed\n Glassdoor\nFor additional support with your job/internship search, schedule an appointment with a career counselor on Spartan Connect ."
    },
    {
        "id": "97",
        "title": "Online Networking-Graduate",
        "description": "Online Networking Spend time actively building and updating your online presence to be more successful during your SJSU graduate studies and your professional career. Connect with people on social platforms, join forums and discussions to stay updated on industry trends, and follow companies of interest. Utilizing LinkedIn\nAbout 80% of recruiters use LinkedIn to evaluate candidates when hiring (Jobvite, 2016). Connect with alumni and professionals in the field, research companies, and identify who in your network is connected to the company.\nBuilding Your Proflie\nMake your profile standout by showcasing your experience and skills. Here are some tips to develop a strong LinkedIn profile:\n Create a headline and summary to highlight your key skills, experience, and goals. Here is a sample of a headline and summary for a career in academia:\nHeadline: Ed.D. Student. Lecturer at San Jose State University. Summary:  I am a dedicated educator with 8+ years of teaching experience. I have worked in a K-5 district that primarily serves culturally diverse students from disadvantaged backgrounds. My research interests lie in finding best practices and strategies to improve educational equity and access to address the needs of underrepresented minorities. I am passionate and committed to improving the learning environment of the students I serve to help bridge the achievement gap. Here is a sample of a headline and summary for a career in non-academia:\nHeadline: Business Operations Analyst, MBA Student\nSummary:  I am a highly motivated professional with 4+ years of experience in business operations. I have reduced operational costs at small and large sized companies by assessing budgets from different angles and making appropriate recommendations. I would like to apply and further develop my skills in business operations at a multinational corporation.  Add any research experience, publications, presentations, and grants awarded. If you're in the field of research, having your work published is a great way to further market yourself.\n Post articles, pictures, or updates related to your industry. For example, post a picture of you at a professional event and briefly mention what you learned and enjoyed the most.  Ask for recommendations from supervisors or colleagues to include on your LinkedIn profile. Having others praise your work and skills adds further credibility to your profile.\n Stay active on LinkedIn and define your goal. Do you want to expand your network by connecting with professionals in the field? Are you searching for a new opportunity? Are you keeping up with industry trends and posting articles? Determine your purpose and what level of activity makes sense.\nMaking Connections\nConnect with alumni and professionals in your industry by sending them a personalized message to invite them to your network and to ask about setting up an informational interview .\nSample of personalized message for a professional in academia:\nDear Dr._____, my name is Sammy Spartan. I currently pursuing my Ph.D in ____ and I noticed that your research experience is in ____. I would appreciate the opportunity to connect with you to learn more about your research.\nSample of personalized message for a professional in non-academia:\nDear _____, my name is Sammy Spartan. I currently pursuing my MBA at SJSU and noticed you're cur -\nrently working as a project manager at Cisco. I have a high interest in project management and I would like to connect with you as a fellow Spartan and learn more about your role. Follow companies and organizations of interest to learn about new initiatives, job opportunities, product  launches, and to expand your network by connecting with employees. Join professional organizations, industry groups, and your alumni association(s).\nFor information on how to build your LinkedIn profile, make connections, and set up an informational interview , review the Linkedin section in our Job/Internship Search Guide .\nSJSU Handshake\nHandshake is the SJSU Career Center job and internship database for currently enrolled students. Handshake uses cutting edge technology to help students connect with employers, source jobs and internships, register for employer information sessions, and view upcoming on- and off-campus career-focused events. Employers who post internships and jobs on Handshake are focused on recruiting SJSU students, which is the key reason to create your profile!\nBuilding Your Profile\nGet started on SJSU job and internship database!\n Log in with your SJSUOne ID and password.\n Fill out your career interests completely for customized events, articles, and opportunities.\n Set up and complete your profile to maximize your search efforts and be found by employers who are looking for SJSU talent.  Utilize the different search filters including job type, industry, job function, and location.\n Upload your resume and any other relevant documents to better market yourself to employers.\n Download the Handshake app for easy access!\nMaking Connections\nMessage and connect with graduate students from SJSU and other universities in your field of study with questions on career-related topics such as:\n Professional experience\n Education recommendations\n Resume advice\n Interview advice\n Inside information about a company and/or position\n Q&A or other career-related topics"
    },
    {
        "id": "98",
        "title": "In-Person Networking-Graduate",
        "description": "In-Person Networking\nYou may already be submitting your resume for opportunities, and your Linkedin and Handshake profiles are getting viewed by recruiters and employers. However, that only part of the process to get an internship or job in a competitive and constantly changing job market. Therefore, your networking needs to go beyond your online presence.\nWhy Live Networking is Important\n1. As many as 70 - 85% of people have ended up in their current position thanks to networking ( Payscale, 2017 ).\n2. Referrals are the leading source of candidates for over 80% of employers ( Forbes, 2019 )\n3. Opportunity to gain inside knowledge of the hiring process and work culture\n4. Connect to people who are influencers and stay current in your field\n5. Networking can positively build and extend your professional reputation\nNetworking On-Campus\nHere are some ways to build your SJSU network:  Join a student organization   Attend employer events  and other SJSU events  Ask your college professors and academic advisors for ideas\n Check with your department about other opportunities\n Email carrie.mcknight@sjsu.edu to schedule an appointment for additional support on networking strategies\nNetworking Off-Campus\nHere are some ways to further develop your network:\n Ask your classmates, friends, colleagues where they network and socialize\n Check social media: Linkedin, Facebook, Twitter, and Instagram\n Log in to SJSU Mentoring & Meetups  using your SJSU One ID and password. Access Quick Connections, to view profiles of alumni and other industry professional mentors from a diverse range of fields who can help you achieve career success\n Search for events on networking sites such as Meetup and Eventbrite\n Become an active member of a professional organization in your field of study; consider joining their board and/or committee to get further involved\n Attend conferences in your field; offer to volunteer or be a presenter to gain more visibility and build your network\n Set up informational interviews with SJSU alumni and professionals working at target companies/\nindustries\nHow to Start a Conversation\nPreparing a conversation starter helps you introduce yourself to a new contact or potential employer with confidence. Take time to develop a pitch to highlight your graduate studies, professional experience, career goals, and any relevant activities.\nHere is an example of how you would introduce yourself to a STEM employer at an industry event:  Hi, my name is_____.  I working on my Masters in Electrical Engineering at SJSU, and will graduate in May 20xx. I have 2 years of work experience working for a tech company in India after completing my Bachelor in Engineering., and my key technical skills are electrical design and Python. I am an active student member of the Institute of Electrical and Electronics Engineers, and attend Bay Area technical conferences. I here to learn more about your current Mechanical Engineering position at (company name).\nHere is an example of how you would introduce yourself to a professor to express interest in a teaching position:\nHello Dr.____, My name is ____ and I recently completed my MS in Biological Sciences at SJSU. I have 2 years of experience as a Graduate Teacher Assistant at ____ where I taught sections in the following subjects: microbiology, physiology, and molecular biology. I assisted professors with developing curriculum, lab materials, and facilitating study groups. I am committed to helping students learn by applying different teaching methodologies that will address students' unique learning styles.\nWhat NOT To Do When Networking\nThere is more to networking than just showing up at a professional event.  Here is a list of what not to do when meeting other attendees or employers:\n Ask the question Are you hiring? The employer doesn know you and this can come off too aggressive. Remember the key is to first build a relationship.\n Take longer than 30 seconds to introduce yourself.\n Fail to do research ahead of time on the event (speakers/employers, topics/opportunities, etc.)\n Ask for a business card without an introduction or follow-up.\n Discuss religion, politics, personal issues, or other controversial topics.\n Dress inappropriately; you want to give a good first impression!"
    },
    {
        "id": "99",
        "title": "Interview Prep-Graduate",
        "description": "Interview Preparation\nThe main goal of the interview process is to not only determine if you meet the qualifications for the position, but also determine if you are a good fit for the company or organization. The employer wants to know how well you will perform the duties and tasks required and whether you will be a great addition to the team. Academic Positions\nInterviewing for research and teaching positions can be a challenging process, but it is also an opportunity to share your work and make a strong impression. Research Positions\nHere are a few sample research interview questions:\n1. Describe your research. How is your research relevant to this position?\n2. How do you see your research impacting the field?\n3. If you were to start your research again today, what would you do differently?\n4. Describe a research problem you have faced. What did you learn?\n5. What experience do you have with attracting funding?\nTeaching Positions\nHere is a sample of a few common teaching interview questions: 1. Why did you decide to become a teacher? 2. What is your teaching philosophy? 3. Describe your classroom management structure.\n4. How would you meet the unique educational needs of your students?\n5. What interests you about our campus?\nNon-Academic Positions\nBelow is a list of general, common interview questions. 6. Tell me about yourself.\n7. Why do you want to work here?\n8. Why should we hire you?\n9. What is your greatest strength?\n10. What is your greatest weakness?\nFor a list of more questions and tips on how to prepare for an interview, review our Interviewing Guide ."
    },
    {
        "id": "100",
        "title": "Career Center Services-Graduate",
        "description": "Overview of Career  Center Services\nSan Jose State University Career Center can assist you with a variety of services towards achieving your career goals. Whether it resume writing, job/ internship search, interview preparation, or anything career related, we are here for you. Below is a list of our virtual apps, online resources, and services.\nVirtual Career Center Apps\nGet started by checking out our virtual apps!\n SJSU Handshake : Search for jobs/internships and career events.\n VMock: Receive instant and personalized resume feedback.\n SJSU Mentoring & Meetups : Connect with professionals to conduct informational interviews.\n Focus2: Take self-assessments to explore careers.\n Big Interview : Practice interviewing by recording yourself answering interview questions.\nFor a full list of our Career Center apps, visit careercenter.sjsu.edu/.\nCareer Resources Online\nJob/Internship Search Guide\nStarting Your Search | Networking with Employers | Preparing Your Professional Pitch | Attending Job/\nInternship Fairs & Info Sessions | Utilizing LinkedIn | Conducting an Informational Interview\nResume/Cover Letter Guide\nResume Basics | Resume Samples (By Interest Area) | Writing Accomplishment Statements | Using Action Verbs | Identifying Transferable Skills | Online Resume Review (VMock) | Applicant Tracking Systems | CV vs. Resume | Cover Letter Basics | Cover Letter Sample | Reference List Basics\nInterviewing Guide\nInterviewing Basics | Big Interview | Types of Interviews | Common Interview Questions | Behavioral, Situational, and Difficult Questions | Interview Attire | Interview Etiquette | Thank You Notes | Negotiating an OfferAlumni Services\nRecent graduates have access to basic services, including SJSU Handshake and online career  education, career coaching appointments, and career education workshops for a year after graduation.  Continued access to on-campus recruiting, including career fairs and employer information  sessions, requires a current Career Center Alumni Membership and is subject to select events.\nPortfolium\nCreate a Career Portfolio to showcase your academic work, projects, career accomplishments, skills, and  experience using Portfolium.\nPhD.org\nFind the graduate school that is right for you at PhD.\norg. Review over 4000 doctoral programs across 59 fields.\nOne-on-One Career Counseling Appointments\nGraduate students can schedule a 30-minute  appointment (in-person, phone, or virtual) by emailing carrie.mcknight@sjsu.edu. Career counseling  sessions cover all career related topics.\n Exploring Majors/Careers\n Job/Internship Search Strategies\n Resume/Cover Letter\n Interviewing\n Exploring Graduate School\n Online Profiles (Handshake, LinkedIn, and Portfolium profiles)\n Considering an Offer\n Interacting with Employers\nDrop-in Advising\nStop by the Career Center for a 15-minute session for career support with:\n Resume advising\n Cover letter advising\n Job/internship search\n Brief career exploration\n Quick interview tips\n Brief online profile review"
    },
    {
        "id": "101",
        "title": "Basics",
        "description": "\nInterviewing Basics\nCongratulations! You impressed the employer with your experience and skills and now have an opportunity  to interview with the employer. Interviews may occur on the phone, at the employer site, at a job fair,   or virtually. But no matter where they occur, preparation is the key to success.\nBig Interview is an online tool available to SJSU students. It will help you review , practice, and record hundreds of practice interview questions from various industries. Register at sjsu.biginterview.com  with your SJSU email.\nTypes of Interviews\nPHONE SCREEN\nPhone screens are typically 15-30 minutes and include basic questions. The interviewer objective is to verify the information on your resume, determine if you fully understand   the job, and learn about why you want this job. Prepare for a phone screen by finding a quiet place. Demonstrate enthusiasm by varying your voice and minimizing reading off your resume, which can sound overly monotonous. VIDEO INTERVIEW\nVideo interviews may be used similarly to phone screens to narrow down candidates, particularly if the employer location is not nearby. Prepare for a video interview by finding a quiet, clean, well-lit area. Practice using the technology in advance. Ensure your camera and sound are working correctly. Look at the camera instead of the screen to mimic eye contact.\n1-ON-1 INTERVIEW\n1-on-1 interviews are the most common. Ask for the interviewer name and position before  the interview. Search for the interviewer LinkedIn profile to better understand what   the interviewer might be looking for.\nGROUP INTERVIEW Group interviews consist of one or two interviewers and a larger group of interviewees being interviewed together. This type of interview could be chosen by the employer to save time and to observe how the interviewees interact with each other. Participate and contribute to the discussion without monopolizing the entire conversation. PANEL INTERVIEW Panel interviews consist of multiple interviewers and one interviewee: you. Ask for the interviewers' names and positions before the interview. Greet and shake the hands of all panel members when you enter the room. When responding to questions, start your eye contact with the person who asked the question, then rotate eye contact and conclude your answer with eye contact back on the panel member who asked the question."
    },
    {
        "id": "102",
        "title": "Common Interview Questions",
        "description": "\nCommon Interview Questions\nWrite down your responses to the top 10 most commonly asked interview questions.\n1. Tell me about yourself.\nTip: You have a short timeframe to answer this question, so don repeat the information on your resume. Instead, focus on your education/degree, key skills, and how your education and experience relate to the qualifications for the job.\n2. Why do you want to work here?\nTip: The interviewer wants to see that you studied the job posting, researched the company, and you are genuinely  enthusiastic about the position. Focus on the education and skills you will bring to the company more than what the company will do for you.\n3. Why should we hire you?\nTip: This is an opportunity to highlight your key strengths and describe your most memorable selling points for the job. One approach is to mention any unique combination of skills and experience you have that can make you stand out from the other candidates. 4. What is your greatest strength?\nTip: To prepare your answer, make a list of your top strengths and decide which three are most relevant for the position. Avoid choosing generic strengths that anyone can claim like you're a hard worker or people person. Be specific and prepare an example to demonstrate each strength.\n5. What is your greatest weakness?\nTip: Choose a weakness that is not essential to the job requirements. Consider something you have limited knowledge  of, and explain how you are working to improve that knowledge or skill. This allows you to show that you are motivated  to learn and contribute to the company, and you can answer this question in a positive way.\n\nCommon Interview Questions (continued)\n6. What accomplishment are you most proud of and why?\nTip: Review your resume and use an accomplishment that is relevant to the job. Expand on it and tell a story using the STAR (Situation, Task, Action, Result) method (for more help, see the Resume Guide ).\n7. Where do you see yourself in 5 years?\nTip: Think about where this position could realistically take you and how that aligns with some of your broader professional goals. Look at the company team organization and think about how you would like to grow within the company.\n8. Tell me about a time when you faced a challenge and overcame it.\nTip: Look at your college projects or jobs, think about a challenging project or situation you encountered and the steps you took to address and resolve it, either by yourself or with a team.\n9. Tell me about a time when you had to resolve a conflict with a coworker or classmate.\nTip: Choose a situation in which you found a way to maintain a positive professional relationship. Ideally, this situation allowed you to demonstrate your professionalism, team skills, people skills, and calm under pressure.\n10. Do you have any questions for me?\nTip: Ask questions that would help you gain insight for future interviews, such as: What are key skills and qualities you are seeking in a candidate? What do you see as some of the challenges of this position? What do you want the new person to achieve in the first three months on the job? What is the next step in your hiring process?"
    },
    {
        "id": "103",
        "title": "Types of Questions",
        "description": "\nBehavioral Questions\nBehavioral interview questions focus on how you handled various situations in the past. They typically start with Tell me about a time when or Give me an example. When you hear these words, think about your  answer in the STAR (Situation, Task, Action, Result) format (for more help, see the Resume Guide ).\nExamples\n Tell me about a time when you had dealt with a difficult customer or co-worker. How did you handle the situation?\n Give an example of a time when you had make a relatively quick decision. What was the decision and what was your thought process behind your choice?\n Tell me about a time when you had to deal with a high-pressure situation. How did you cope with the stress?\n Give me an example of a time when you went above and beyond the call of duty to get a job done.\n Tell me about a time when you had to lead a project or team. What did you learn from that experience?\n Tell me about a time when your team wasn pulling their weight in a project. How did you handle it?\nSituational Questions\nSituational questions are theoretical questions meant to assess your critical thinking skills and gain information about how you make decisions and think through difficult situations.\nExamples\n You are given several tasks with competing deadlines. How would you prioritize them?\n You are working with a client who is making unreasonable demands. How do you respond to them?\n You disagree with your boss about how to proceed on a project. How would you handle the situation?\n You are given constructive criticism by your boss, and you disagree with it. How would you address   the situation?\n If you could have coffee with anyone in history, who would it be and why?\n\nDifficult Questions\nDifficult questions gauge how you respond to situations when you are caught off guard. They can assess  your critical thinking skills, self-awareness, and growth mindset. Don be afraid to ask for a minute to think before answering. For riddles such as How many gas stations are in the U.S.? process your answer out loud. The interviewer is not looking for the correct answer but your critical thinking and problem-solving process.\nExamples\n Tell me about a mistake that you made. Looking back, what would you have done differently?\n What are three things that you think you need to work on?\n Describe your worst boss.\n What is one thing that you would change about your last job and why?\n How many times does a clock hands overlap?\n If you had one superpower, what would it be and why?\nIllegal/Improper Questions\nCertain questions are illegal or improper for interviewers to ask because they can be used to discriminate against candidates based on protected classes (race, color, religion, sex, disability, familial status, or national origin). Salary and criminal history inquiries are banned in California, including on job applications. When facing an illegal/improper question, determine why the interviewer is asking that question, avoid directly answering the question, and turn the conversation to your strengths.\nExamples\n Are you married or single?\n Do you plan to have children in the next year?\n Do you have a disability?\n What your race?\nQuestions to Ask the Interviewer\nAt the end of every interview, your interviewer will most likely ask if you have any questions they can answer.  It is always a good idea to have some questions prepared to demonstrate your interest in the position. Examples\n What type of professional development opportunities do you offer your employees?\n Can you tell me about the training and supervision I will receive during my first year?\n What potential growth opportunities are available within your company?\n Can you describe some of the projects and assignments I will be assigned during my first year?\n What are some of the department/company goals for the upcoming year?\n What are the biggest challenges that new hires face in their first year?"
    },
    {
        "id": "104",
        "title": "Interview Etiquette",
        "description": "\nInterview Etiquette\nYour positive attitude plays a key role in the interview process and sets the stage for your success. You can have a great resume, college degree, and required skills for the job but, employers are also evaluating how well you fit into the work environment and work with others. Learn how to project a polite and professional appeal.\nIntroductions\n Be friendly to all employees the moment you enter the building this is your chance to make a great   first impression!\n Make sure to look people in the eyes, and smile to seem confident and approachable.\n Give a firm (but not too firm) handshake.\nDiscussions\n Try not to interrupt people in the middle of a story this shows people you value their ideas and company.\n Don talk too loudly or for too long these actions might make you seem self-centered.\n Stay away from negative conversations they can build mistrust.\n If you struggle to come up with conversation topics, equip yourself with conversation starters for example, from watching the news, reading an interesting article, or attending a professional event.\nBody Language / Non-Verbal Behavior\n Show that you're focused on the conversation by keeping eye contact, nodding, smiling, and using other nonverbal positive gestures.\nThank Y ou Notes\nAfter an interview, job/internship fair, or employer event, always send a thank you email to the person you spoke to. Example\nDear First Name,\nThank you very much for the interview yesterday. I wish to reaffirm my strong interest in the position with your organization. As we discussed, I feel that my recent Bachelor degree in Communications, my semester projects, and volunteer experience have provided me with an understanding of business operations which will prove to be an asset to your organization. I have always been considered a dedicated student, hard worker, and dependable team member, and I am confident that I can make a valuable contribution to your organization. I also enjoyed discussing our shared interest in the local environment and community service. I look forward to hearing from you soon.\nSincerely,\nYour First and Last Name"
    },
    {
        "id": "105",
        "title": "Negotiating Offer",
        "description": "\nNegotiating an Offer Congratulations! Your hard work has landed you an internship/job offer! Now you get to choose whether  or not to accept the offer and if you should negotiate. Compensation is only one factor in an ideal job offer , though it is often considered the most important. To determine the compensation range for similar roles, check sources such as the SJSU Career Outcomes (First Destination Survey ), the Educate to Career  Job Salary Calculator , Payscale , and Glassdoor .\nFactors to Consider\n Benefits:  Does the employer offer medical, dental, and vision? If it does, how much does the employer cover? What options does the employer offer for retirement?\n Vacation/Sick Time:  How much vacation and sick time will you earn?\n Location:  How long is the commute? Is there public transit available if needed?\n Work/Life Balance:  What is the expected work schedule? Does the employer offer telecommuting or flexible work schedules? Will you be an exempt (salaried) or non-exempt (hourly) employee?\n Professional Development:  Does the employer support professional development opportunities   (i.e., conferences, trainings) or provide financial aid for continuing education?\n Company Culture:  What is the work environment like? If you conduct salary research and find that the offer is fair, you may accept it. In other instances based on your research, you might decide to negotiate salary and benefits.\nUnder 2018 California Employment Laws, employers can no longer ask candidates about their salary history . Employers also must provide the pay scale for a position in the job posting. Salary Negotiation Tips\n Be Reasonable:  Knowing what your employer typically pays, as well as what competitors typically pay ,  will help you appear informed, educated, and ready for discussion.  Be Gracious: If the offer you are given does not fit your desired income, don panic! Keep your demeanor neutral and express gratitude for the offer before jumping into the negotiation. Express confidence in your ability to succeed in the job and provide reasons to support your request such as relevant experience, special skills, or current competing job offers.\n Be Creative: Examine the compensation packet carefully and don hesitate to ask the HR representative questions about employee benefits such as health insurance, employee wellness programs, vacation, and sick leave.\nIf it becomes clear that the salary is fixed, be respectful and ask if it would be possible to establish a 90-day evaluation period to re-visit your salary if you meet (better yet exceed) your goals."
    },
    {
        "id": "106",
        "title": "Accepting Offer",
        "description": "\nAfter Accepting an Offer\nOnce you accept a job/internship offer, we recommend you stop applying or interviewing for other roles.  Accepting a job offer means you have officially committed to work for a specific organization. Review our student services and expectations  web page for more information. If there are circumstances in which you  are considering another offer, please schedule an appointment  with your career counselor to talk through your specific situation and the best options to move forward with minimal negative impact on the employer you are working with.\nKeep in mind the following considerations, tips, and sample language if you decide to move forward with withdrawing an accepted offer.\nWhat does it mean to renege on accepting a job offer?\n The act of reneging on an acceptance of a job offer in the job search process happens when a candidate accepts a job or internship offer (verbally or in writing) and then rescinds that acceptance (before starting  or soon after starting).\n California is an at-will employment state meaning that the employer or the employee can legally terminate the employment relationship at any time, with or without cause.\n Keep in mind, that there are short- and long-term consequences that need to be considered prior to reneging  on an accepted offer.\nWhy does it happen?\n The candidate doesn stop interviewing and applying for jobs, even after accepting an offer\n The candidate receives a better offer from a competing organization\n Emergency circumstances occur such as a personal illness or needing to care for an ill family member\n An unexpected move\nThings to Consider Before You Renege on an Offer\n It can take a lot of time and resources for a recruiter to interview multiple candidates and decide who will receive the offer. Once a hire is made other candidates are turned down and recruiting stops.\n When a candidate reneges, the recruiter has to start the hiring process all over again which also leads to the position not being filled for a longer period.\n When students renege on an offer, it reflects badly on the university, and the recruiter may decide to stop recruiting which affects the whole campus.\n Even in a large metropolitan area like Silicon Valley, it is not uncommon for professionals in similar industries to be connected. You don want to create a negative reputation for yourself or SJSU as flakey or unreliable.\nThings to Do Before you Renege on an Offer  Consult with a career counselor  to discuss the situation and how to approach your communication with  the employer.\n Speak with the hiring manager first to share that you have received a competing offer from another organization, and allow your current employer the chance to counteroffer .\nUpdated 09092024"
    }
]